TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Thu Oct 02 08:28:39 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/tasks.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("strncpy")

    3560                    $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
    3561                            .dwattr $C$DW$239, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3562                            .dwattr $C$DW$239, DW_AT_decl_line(0x90)
    3563                            .dwattr $C$DW$239, DW_AT_decl_column(0x02)
    3564                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    3565                            .dwattr $C$DW$240, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3566                            .dwattr $C$DW$240, DW_AT_decl_line(0x91)
    3567                            .dwattr $C$DW$240, DW_AT_decl_column(0x02)
    3568                    $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    3569                            .dwattr $C$DW$241, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3570                            .dwattr $C$DW$241, DW_AT_decl_line(0x92)
    3571                            .dwattr $C$DW$241, DW_AT_decl_column(0x02)
    3572                    $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    3573                            .dwattr $C$DW$242, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3574                            .dwattr $C$DW$242, DW_AT_decl_line(0x93)
    3575                            .dwattr $C$DW$242, DW_AT_decl_column(0x02)
    3576                    $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    3577                            .dwattr $C$DW$243, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3578                            .dwattr $C$DW$243, DW_AT_decl_line(0x94)
    3579                            .dwattr $C$DW$243, DW_AT_decl_column(0x02)
    3580                            .dwendtag $C$DW$T$52
    3581                    
    3582                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3583                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x8f)
    3584                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    3585                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    3586                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    3587                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    3588                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3589                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x95)
    3590                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    3591                    
    3592                    $C$DW$T$54      .dwtag  DW_TAG_enumeration_type
    3593                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    3594                    $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    3595                            .dwattr $C$DW$244, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3596                            .dwattr $C$DW$244, DW_AT_decl_line(0x9a)
    3597                            .dwattr $C$DW$244, DW_AT_decl_column(0x02)
    3598                    $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    3599                            .dwattr $C$DW$245, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3600                            .dwattr $C$DW$245, DW_AT_decl_line(0x9b)
    3601                            .dwattr $C$DW$245, DW_AT_decl_column(0x02)
    3602                    $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
    3603                            .dwattr $C$DW$246, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    3604                            .dwattr $C$DW$246, DW_AT_decl_line(0x9c)
    3605                            .dwattr $C$DW$246, DW_AT_decl_column(0x02)
    3606                            .dwendtag $C$DW$T$54
    3607                    
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   67

    3608                            .dwattr $C$DW$T$54, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3609                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x99)
    3610                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    3611                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    3612                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    3613                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3614                            .dwattr $C$DW$T$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3615                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x9d)
    3616                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x03)
    3617                    
    3618                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3619                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
    3620                    $C$DW$247       .dwtag  DW_TAG_member
    3621                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$10)
    3622                            .dwattr $C$DW$247, DW_AT_name("fd")
    3623                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("fd")
    3624                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3625                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3626                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3627                            .dwattr $C$DW$247, DW_AT_decl_line(0x5b)
    3628                            .dwattr $C$DW$247, DW_AT_decl_column(0x0b)
    3629                    $C$DW$248       .dwtag  DW_TAG_member
    3630                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3631                            .dwattr $C$DW$248, DW_AT_name("buf")
    3632                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("buf")
    3633                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3634                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3635                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3636                            .dwattr $C$DW$248, DW_AT_decl_line(0x5c)
    3637                            .dwattr $C$DW$248, DW_AT_decl_column(0x16)
    3638                    $C$DW$249       .dwtag  DW_TAG_member
    3639                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3640                            .dwattr $C$DW$249, DW_AT_name("pos")
    3641                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("pos")
    3642                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3643                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3644                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3645                            .dwattr $C$DW$249, DW_AT_decl_line(0x5d)
    3646                            .dwattr $C$DW$249, DW_AT_decl_column(0x16)
    3647                    $C$DW$250       .dwtag  DW_TAG_member
    3648                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3649                            .dwattr $C$DW$250, DW_AT_name("bufend")
    3650                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("bufend")
    3651                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3652                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3653                            .dwattr $C$DW$250, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3654                            .dwattr $C$DW$250, DW_AT_decl_line(0x5e)
    3655                            .dwattr $C$DW$250, DW_AT_decl_column(0x16)
    3656                    $C$DW$251       .dwtag  DW_TAG_member
    3657                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3658                            .dwattr $C$DW$251, DW_AT_name("buff_stop")
    3659                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("buff_stop")
    3660                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3661                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3662                            .dwattr $C$DW$251, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   68

    3663                            .dwattr $C$DW$251, DW_AT_decl_line(0x5f)
    3664                            .dwattr $C$DW$251, DW_AT_decl_column(0x16)
    3665                    $C$DW$252       .dwtag  DW_TAG_member
    3666                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$11)
    3667                            .dwattr $C$DW$252, DW_AT_name("flags")
    3668                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("flags")
    3669                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3670                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3671                            .dwattr $C$DW$252, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3672                            .dwattr $C$DW$252, DW_AT_decl_line(0x60)
    3673                            .dwattr $C$DW$252, DW_AT_decl_column(0x16)
    3674                            .dwendtag $C$DW$T$20
    3675                    
    3676                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3677                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
    3678                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    3679                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3680                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$20)
    3681                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3682                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3683                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x61)
    3684                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    3685                    
    3686                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3687                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
    3688                    $C$DW$253       .dwtag  DW_TAG_member
    3689                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$10)
    3690                            .dwattr $C$DW$253, DW_AT_name("quot")
    3691                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("quot")
    3692                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3693                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3694                            .dwattr $C$DW$253, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3695                            .dwattr $C$DW$253, DW_AT_decl_line(0x50)
    3696                            .dwattr $C$DW$253, DW_AT_decl_column(0x16)
    3697                    $C$DW$254       .dwtag  DW_TAG_member
    3698                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$10)
    3699                            .dwattr $C$DW$254, DW_AT_name("rem")
    3700                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("rem")
    3701                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3702                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3703                            .dwattr $C$DW$254, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3704                            .dwattr $C$DW$254, DW_AT_decl_line(0x50)
    3705                            .dwattr $C$DW$254, DW_AT_decl_column(0x1c)
    3706                            .dwendtag $C$DW$T$21
    3707                    
    3708                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3709                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x50)
    3710                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3711                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3712                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$21)
    3713                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3714                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3715                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x50)
    3716                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x23)
    3717                    
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   69

    3718                    $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3719                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
    3720                    $C$DW$255       .dwtag  DW_TAG_member
    3721                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$10)
    3722                            .dwattr $C$DW$255, DW_AT_name("quot")
    3723                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("quot")
    3724                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3725                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3726                            .dwattr $C$DW$255, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3727                            .dwattr $C$DW$255, DW_AT_decl_line(0x52)
    3728                            .dwattr $C$DW$255, DW_AT_decl_column(0x16)
    3729                    $C$DW$256       .dwtag  DW_TAG_member
    3730                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$10)
    3731                            .dwattr $C$DW$256, DW_AT_name("rem")
    3732                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("rem")
    3733                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3734                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3735                            .dwattr $C$DW$256, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3736                            .dwattr $C$DW$256, DW_AT_decl_line(0x52)
    3737                            .dwattr $C$DW$256, DW_AT_decl_column(0x1c)
    3738                            .dwendtag $C$DW$T$22
    3739                    
    3740                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3741                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x52)
    3742                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
    3743                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3744                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
    3745                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    3746                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3747                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x52)
    3748                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x23)
    3749                    
    3750                    $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3751                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x10)
    3752                    $C$DW$257       .dwtag  DW_TAG_member
    3753                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$14)
    3754                            .dwattr $C$DW$257, DW_AT_name("quot")
    3755                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("quot")
    3756                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3757                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3758                            .dwattr $C$DW$257, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3759                            .dwattr $C$DW$257, DW_AT_decl_line(0x55)
    3760                            .dwattr $C$DW$257, DW_AT_decl_column(0x1c)
    3761                    $C$DW$258       .dwtag  DW_TAG_member
    3762                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$14)
    3763                            .dwattr $C$DW$258, DW_AT_name("rem")
    3764                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("rem")
    3765                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3766                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3767                            .dwattr $C$DW$258, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3768                            .dwattr $C$DW$258, DW_AT_decl_line(0x55)
    3769                            .dwattr $C$DW$258, DW_AT_decl_column(0x22)
    3770                            .dwendtag $C$DW$T$23
    3771                    
    3772                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   70

    3773                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x55)
    3774                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
    3775                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3776                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$23)
    3777                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3778                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3779                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x55)
    3780                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x29)
    3781                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3782                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3783                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3784                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3785                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3786                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    3787                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$3)
    3788                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    3789                            .dwattr $C$DW$T$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3790                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x6a)
    3791                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x10)
    3792                    $C$DW$T$67      .dwtag  DW_TAG_pointer_type
    3793                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    3794                            .dwattr $C$DW$T$67, DW_AT_address_class(0x20)
    3795                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("xTimerHandle")
    3796                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$3)
    3797                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3798                            .dwattr $C$DW$T$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    3799                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x6d)
    3800                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x10)
    3801                    
    3802                    $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    3803                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3804                    $C$DW$259       .dwtag  DW_TAG_formal_parameter
    3805                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$3)
    3806                            .dwendtag $C$DW$T$42
    3807                    
    3808                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3809                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3810                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3811                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    3812                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3813                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3814                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    3815                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x4f)
    3816                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3817                    
    3818                    $C$DW$T$69      .dwtag  DW_TAG_subroutine_type
    3819                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3820                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3821                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3822                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3823                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    3824                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3825                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3826                            .dwattr $C$DW$T$71, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3827                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xa3)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   71

    3828                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x14)
    3829                    $C$DW$T$104     .dwtag  DW_TAG_const_type
    3830                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$2)
    3831                    $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    3832                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    3833                            .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
    3834                    
    3835                    $C$DW$T$106     .dwtag  DW_TAG_subroutine_type
    3836                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3837                    $C$DW$260       .dwtag  DW_TAG_formal_parameter
    3838                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$68)
    3839                            .dwendtag $C$DW$T$106
    3840                    
    3841                    $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    3842                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
    3843                            .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    3844                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("tmrTIMER_CALLBACK")
    3845                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    3846                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3847                            .dwattr $C$DW$T$108, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inc
    3848                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x70)
    3849                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x10)
    3850                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3851                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3852                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3853                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3854                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3855                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3856                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3857                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3858                    
    3859                    $C$DW$T$29      .dwtag  DW_TAG_array_type
    3860                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    3861                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3862                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x10)
    3863                    $C$DW$261       .dwtag  DW_TAG_subrange_type
    3864                            .dwattr $C$DW$261, DW_AT_upper_bound(0x0f)
    3865                            .dwendtag $C$DW$T$29
    3866                    
    3867                    $C$DW$T$45      .dwtag  DW_TAG_const_type
    3868                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$5)
    3869                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3870                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3871                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3872                    $C$DW$T$47      .dwtag  DW_TAG_const_type
    3873                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3874                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3875                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3876                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3877                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3878                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
    3879                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3880                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
    3881                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3882                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   72

    3883                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3884                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3885                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3886                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3887                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3888                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3889                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3890                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3891                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3892                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3893                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3894                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$9)
    3895                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3896                            .dwattr $C$DW$T$110, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3897                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x6a)
    3898                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x1a)
    3899                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3900                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3901                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3902                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3903                    
    3904                    $C$DW$T$111     .dwtag  DW_TAG_subroutine_type
    3905                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$10)
    3906                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3907                    $C$DW$262       .dwtag  DW_TAG_formal_parameter
    3908                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$105)
    3909                    $C$DW$263       .dwtag  DW_TAG_formal_parameter
    3910                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$105)
    3911                            .dwendtag $C$DW$T$111
    3912                    
    3913                    $C$DW$T$112     .dwtag  DW_TAG_pointer_type
    3914                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
    3915                            .dwattr $C$DW$T$112, DW_AT_address_class(0x20)
    3916                    $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("__TI_compar_fn")
    3917                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$112)
    3918                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3919                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3920                            .dwattr $C$DW$T$113, DW_AT_decl_line(0xa6)
    3921                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x13)
    3922                    $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    3923                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$10)
    3924                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3925                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3926                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x31)
    3927                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x1c)
    3928                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3929                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3930                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3931                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3932                    $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3933                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$11)
    3934                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    3935                            .dwattr $C$DW$T$60, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3936                            .dwattr $C$DW$T$60, DW_AT_decl_line(0x57)
    3937                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x19)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   73

    3938                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3939                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3940                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3941                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3942                    $C$DW$T$121     .dwtag  DW_TAG_volatile_type
    3943                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$12)
    3944                    
    3945                    $C$DW$T$122     .dwtag  DW_TAG_subroutine_type
    3946                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$12)
    3947                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    3948                    $C$DW$264       .dwtag  DW_TAG_formal_parameter
    3949                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$3)
    3950                            .dwendtag $C$DW$T$122
    3951                    
    3952                    $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    3953                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$122)
    3954                            .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    3955                    $C$DW$T$124     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    3956                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$123)
    3957                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    3958                            .dwattr $C$DW$T$124, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inc
    3959                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x66)
    3960                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x19)
    3961                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3962                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$12)
    3963                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3964                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3965                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x6d)
    3966                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x0e)
    3967                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3968                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3969                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3970                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3971                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    3972                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    3973                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    3974                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3975                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    3976                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3977                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    3978                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3979                    $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    3980                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$13)
    3981                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3982                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    3983                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x6a)
    3984                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x1c)
    3985                    $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3986                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$36)
    3987                            .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3988                    $C$DW$T$84      .dwtag  DW_TAG_const_type
    3989                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3990                    $C$DW$T$133     .dwtag  DW_TAG_volatile_type
    3991                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$36)
    3992                    $C$DW$T$14      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   74

    3993                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3994                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3995                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3996                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3997                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3998                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3999                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4000                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    4001                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4002                            .dwattr $C$DW$T$16, DW_AT_name("float")
    4003                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4004                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    4005                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4006                            .dwattr $C$DW$T$17, DW_AT_name("double")
    4007                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    4008                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    4009                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4010                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    4011                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    4012                    $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    4013                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$6)
    4014                            .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    4015                    $C$DW$T$136     .dwtag  DW_TAG_const_type
    4016                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$6)
    4017                    $C$DW$T$137     .dwtag  DW_TAG_pointer_type
    4018                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$136)
    4019                            .dwattr $C$DW$T$137, DW_AT_address_class(0x20)
    4020                    
    4021                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4022                            .dwattr $C$DW$T$24, DW_AT_name("__va_list")
    4023                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    4024                    $C$DW$265       .dwtag  DW_TAG_member
    4025                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$3)
    4026                            .dwattr $C$DW$265, DW_AT_name("__ap")
    4027                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("__ap")
    4028                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4029                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    4030                            .dwattr $C$DW$265, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    4031                            .dwattr $C$DW$265, DW_AT_decl_line(0x32)
    4032                            .dwattr $C$DW$265, DW_AT_decl_column(0x0c)
    4033                            .dwendtag $C$DW$T$24
    4034                    
    4035                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    4036                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x31)
    4037                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    4038                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    4039                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$24)
    4040                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    4041                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    4042                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x33)
    4043                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x03)
    4044                    
    4045                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    4046                            .dwattr $C$DW$T$30, DW_AT_name("tskTaskControlBlock")
    4047                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x44)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   75

    4048                    $C$DW$266       .dwtag  DW_TAG_member
    4049                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$26)
    4050                            .dwattr $C$DW$266, DW_AT_name("pxTopOfStack")
    4051                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("pxTopOfStack")
    4052                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4053                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    4054                            .dwattr $C$DW$266, DW_AT_decl_file("../Source/tasks.c")
    4055                            .dwattr $C$DW$266, DW_AT_decl_line(0x70)
    4056                            .dwattr $C$DW$266, DW_AT_decl_column(0x1b)
    4057                    $C$DW$267       .dwtag  DW_TAG_member
    4058                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$27)
    4059                            .dwattr $C$DW$267, DW_AT_name("xGenericListItem")
    4060                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("xGenericListItem")
    4061                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4062                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    4063                            .dwattr $C$DW$267, DW_AT_decl_file("../Source/tasks.c")
    4064                            .dwattr $C$DW$267, DW_AT_decl_line(0x76)
    4065                            .dwattr $C$DW$267, DW_AT_decl_column(0x0f)
    4066                    $C$DW$268       .dwtag  DW_TAG_member
    4067                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$27)
    4068                            .dwattr $C$DW$268, DW_AT_name("xEventListItem")
    4069                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("xEventListItem")
    4070                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4071                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    4072                            .dwattr $C$DW$268, DW_AT_decl_file("../Source/tasks.c")
    4073                            .dwattr $C$DW$268, DW_AT_decl_line(0x77)
    4074                            .dwattr $C$DW$268, DW_AT_decl_column(0x0f)
    4075                    $C$DW$269       .dwtag  DW_TAG_member
    4076                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$13)
    4077                            .dwattr $C$DW$269, DW_AT_name("uxPriority")
    4078                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("uxPriority")
    4079                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4080                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    4081                            .dwattr $C$DW$269, DW_AT_decl_file("../Source/tasks.c")
    4082                            .dwattr $C$DW$269, DW_AT_decl_line(0x78)
    4083                            .dwattr $C$DW$269, DW_AT_decl_column(0x19)
    4084                    $C$DW$270       .dwtag  DW_TAG_member
    4085                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$28)
    4086                            .dwattr $C$DW$270, DW_AT_name("pxStack")
    4087                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("pxStack")
    4088                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4089                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    4090                            .dwattr $C$DW$270, DW_AT_decl_file("../Source/tasks.c")
    4091                            .dwattr $C$DW$270, DW_AT_decl_line(0x79)
    4092                            .dwattr $C$DW$270, DW_AT_decl_column(0x14)
    4093                    $C$DW$271       .dwtag  DW_TAG_member
    4094                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$29)
    4095                            .dwattr $C$DW$271, DW_AT_name("pcTaskName")
    4096                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("pcTaskName")
    4097                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4098                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    4099                            .dwattr $C$DW$271, DW_AT_decl_file("../Source/tasks.c")
    4100                            .dwattr $C$DW$271, DW_AT_decl_line(0x7a)
    4101                            .dwattr $C$DW$271, DW_AT_decl_column(0x11)
    4102                            .dwendtag $C$DW$T$30
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   76

    4103                    
    4104                            .dwattr $C$DW$T$30, DW_AT_decl_file("../Source/tasks.c")
    4105                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x6e)
    4106                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    4107                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("tskTCB")
    4108                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$30)
    4109                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4110                            .dwattr $C$DW$T$97, DW_AT_decl_file("../Source/tasks.c")
    4111                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x95)
    4112                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    4113                    $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    4114                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    4115                            .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    4116                    $C$DW$T$143     .dwtag  DW_TAG_volatile_type
    4117                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$98)
    4118                    
    4119                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4120                            .dwattr $C$DW$T$35, DW_AT_name("xLIST")
    4121                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    4122                    $C$DW$272       .dwtag  DW_TAG_member
    4123                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$25)
    4124                            .dwattr $C$DW$272, DW_AT_name("uxNumberOfItems")
    4125                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("uxNumberOfItems")
    4126                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4127                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    4128                            .dwattr $C$DW$272, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4129                            .dwattr $C$DW$272, DW_AT_decl_line(0x88)
    4130                            .dwattr $C$DW$272, DW_AT_decl_column(0x22)
    4131                    $C$DW$273       .dwtag  DW_TAG_member
    4132                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$32)
    4133                            .dwattr $C$DW$273, DW_AT_name("pxIndex")
    4134                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("pxIndex")
    4135                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4136                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    4137                            .dwattr $C$DW$273, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4138                            .dwattr $C$DW$273, DW_AT_decl_line(0x89)
    4139                            .dwattr $C$DW$273, DW_AT_decl_column(0x17)
    4140                    $C$DW$274       .dwtag  DW_TAG_member
    4141                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    4142                            .dwattr $C$DW$274, DW_AT_name("xListEnd")
    4143                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("xListEnd")
    4144                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4145                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    4146                            .dwattr $C$DW$274, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4147                            .dwattr $C$DW$274, DW_AT_decl_line(0x8a)
    4148                            .dwattr $C$DW$274, DW_AT_decl_column(0x19)
    4149                            .dwendtag $C$DW$T$35
    4150                    
    4151                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    4152                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x86)
    4153                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    4154                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    4155                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$35)
    4156                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    4157                            .dwattr $C$DW$T$74, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   77

    4158                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x8b)
    4159                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x03)
    4160                    $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    4161                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4162                            .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    4163                    $C$DW$T$144     .dwtag  DW_TAG_volatile_type
    4164                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$75)
    4165                    $C$DW$T$145     .dwtag  DW_TAG_const_type
    4166                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$75)
    4167                    
    4168                    $C$DW$T$146     .dwtag  DW_TAG_array_type
    4169                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$74)
    4170                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    4171                            .dwattr $C$DW$T$146, DW_AT_byte_size(0x28)
    4172                    $C$DW$275       .dwtag  DW_TAG_subrange_type
    4173                            .dwattr $C$DW$275, DW_AT_upper_bound(0x01)
    4174                            .dwendtag $C$DW$T$146
    4175                    
    4176                    $C$DW$T$88      .dwtag  DW_TAG_const_type
    4177                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$74)
    4178                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    4179                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    4180                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    4181                    $C$DW$T$90      .dwtag  DW_TAG_const_type
    4182                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    4183                    
    4184                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4185                            .dwattr $C$DW$T$39, DW_AT_name("xLIST_ITEM")
    4186                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    4187                    $C$DW$276       .dwtag  DW_TAG_member
    4188                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$36)
    4189                            .dwattr $C$DW$276, DW_AT_name("xItemValue")
    4190                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("xItemValue")
    4191                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4192                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    4193                            .dwattr $C$DW$276, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4194                            .dwattr $C$DW$276, DW_AT_decl_line(0x73)
    4195                            .dwattr $C$DW$276, DW_AT_decl_column(0x0f)
    4196                    $C$DW$277       .dwtag  DW_TAG_member
    4197                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$38)
    4198                            .dwattr $C$DW$277, DW_AT_name("pxNext")
    4199                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pxNext")
    4200                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4201                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    4202                            .dwattr $C$DW$277, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4203                            .dwattr $C$DW$277, DW_AT_decl_line(0x74)
    4204                            .dwattr $C$DW$277, DW_AT_decl_column(0x1f)
    4205                    $C$DW$278       .dwtag  DW_TAG_member
    4206                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$38)
    4207                            .dwattr $C$DW$278, DW_AT_name("pxPrevious")
    4208                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("pxPrevious")
    4209                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4210                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    4211                            .dwattr $C$DW$278, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4212                            .dwattr $C$DW$278, DW_AT_decl_line(0x75)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   78

    4213                            .dwattr $C$DW$278, DW_AT_decl_column(0x1f)
    4214                    $C$DW$279       .dwtag  DW_TAG_member
    4215                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$3)
    4216                            .dwattr $C$DW$279, DW_AT_name("pvOwner")
    4217                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("pvOwner")
    4218                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4219                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    4220                            .dwattr $C$DW$279, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4221                            .dwattr $C$DW$279, DW_AT_decl_line(0x76)
    4222                            .dwattr $C$DW$279, DW_AT_decl_column(0x09)
    4223                    $C$DW$280       .dwtag  DW_TAG_member
    4224                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$3)
    4225                            .dwattr $C$DW$280, DW_AT_name("pvContainer")
    4226                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("pvContainer")
    4227                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4228                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    4229                            .dwattr $C$DW$280, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4230                            .dwattr $C$DW$280, DW_AT_decl_line(0x77)
    4231                            .dwattr $C$DW$280, DW_AT_decl_column(0x09)
    4232                            .dwendtag $C$DW$T$39
    4233                    
    4234                            .dwattr $C$DW$T$39, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    4235                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x71)
    4236                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x08)
    4237                    $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    4238                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$39)
    4239                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    4240                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4241                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    4242                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    4243                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$39)
    4244                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4245                            .dwattr $C$DW$T$27, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    4246                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x79)
    4247                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1b)
    4248                    $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    4249                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$27)
    4250                            .dwattr $C$DW$T$78, DW_AT_address_class(0x20)
    4251                    $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    4252                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$27)
    4253                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4254                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4255                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    4256                    
    4257                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4258                            .dwattr $C$DW$T$40, DW_AT_name("xMEMORY_REGION")
    4259                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    4260                    $C$DW$281       .dwtag  DW_TAG_member
    4261                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$3)
    4262                            .dwattr $C$DW$281, DW_AT_name("pvBaseAddress")
    4263                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("pvBaseAddress")
    4264                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4265                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    4266                            .dwattr $C$DW$281, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4267                            .dwattr $C$DW$281, DW_AT_decl_line(0x7a)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   79

    4268                            .dwattr $C$DW$281, DW_AT_decl_column(0x08)
    4269                    $C$DW$282       .dwtag  DW_TAG_member
    4270                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$13)
    4271                            .dwattr $C$DW$282, DW_AT_name("ulLengthInBytes")
    4272                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("ulLengthInBytes")
    4273                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4274                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    4275                            .dwattr $C$DW$282, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4276                            .dwattr $C$DW$282, DW_AT_decl_line(0x7b)
    4277                            .dwattr $C$DW$282, DW_AT_decl_column(0x10)
    4278                    $C$DW$283       .dwtag  DW_TAG_member
    4279                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$13)
    4280                            .dwattr $C$DW$283, DW_AT_name("ulParameters")
    4281                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("ulParameters")
    4282                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4283                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    4284                            .dwattr $C$DW$283, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4285                            .dwattr $C$DW$283, DW_AT_decl_line(0x7c)
    4286                            .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    4287                            .dwendtag $C$DW$T$40
    4288                    
    4289                            .dwattr $C$DW$T$40, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    4290                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
    4291                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4292                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    4293                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$40)
    4294                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4295                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    4296                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x7d)
    4297                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x03)
    4298                    
    4299                    $C$DW$T$49      .dwtag  DW_TAG_array_type
    4300                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4301                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4302                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x0c)
    4303                    $C$DW$284       .dwtag  DW_TAG_subrange_type
    4304                            .dwattr $C$DW$284, DW_AT_upper_bound(0x00)
    4305                            .dwendtag $C$DW$T$49
    4306                    
    4307                    $C$DW$T$99      .dwtag  DW_TAG_const_type
    4308                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$48)
    4309                    $C$DW$T$100     .dwtag  DW_TAG_pointer_type
    4310                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
    4311                            .dwattr $C$DW$T$100, DW_AT_address_class(0x20)
    4312                    $C$DW$T$101     .dwtag  DW_TAG_const_type
    4313                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    4314                    
    4315                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4316                            .dwattr $C$DW$T$41, DW_AT_name("xMINI_LIST_ITEM")
    4317                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    4318                    $C$DW$285       .dwtag  DW_TAG_member
    4319                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$36)
    4320                            .dwattr $C$DW$285, DW_AT_name("xItemValue")
    4321                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("xItemValue")
    4322                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   80

    4323                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    4324                            .dwattr $C$DW$285, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4325                            .dwattr $C$DW$285, DW_AT_decl_line(0x7d)
    4326                            .dwattr $C$DW$285, DW_AT_decl_column(0x0f)
    4327                    $C$DW$286       .dwtag  DW_TAG_member
    4328                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$38)
    4329                            .dwattr $C$DW$286, DW_AT_name("pxNext")
    4330                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("pxNext")
    4331                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4332                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4333                            .dwattr $C$DW$286, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4334                            .dwattr $C$DW$286, DW_AT_decl_line(0x7e)
    4335                            .dwattr $C$DW$286, DW_AT_decl_column(0x1e)
    4336                    $C$DW$287       .dwtag  DW_TAG_member
    4337                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$38)
    4338                            .dwattr $C$DW$287, DW_AT_name("pxPrevious")
    4339                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("pxPrevious")
    4340                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4341                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4342                            .dwattr $C$DW$287, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\inclu
    4343                            .dwattr $C$DW$287, DW_AT_decl_line(0x7f)
    4344                            .dwattr $C$DW$287, DW_AT_decl_column(0x1e)
    4345                            .dwendtag $C$DW$T$41
    4346                    
    4347                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    4348                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x7b)
    4349                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x08)
    4350                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    4351                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$41)
    4352                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4353                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_LM3S1968\Source\incl
    4354                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x81)
    4355                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x20)
    4356                    $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    4357                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4358                    
    4359                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    4360                            .dwattr $C$DW$T$50, DW_AT_name("xTASK_PARAMTERS")
    4361                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x24)
    4362                    $C$DW$288       .dwtag  DW_TAG_member
    4363                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$44)
    4364                            .dwattr $C$DW$288, DW_AT_name("pvTaskCode")
    4365                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("pvTaskCode")
    4366                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4367                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4368                            .dwattr $C$DW$288, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4369                            .dwattr $C$DW$288, DW_AT_decl_line(0x84)
    4370                            .dwattr $C$DW$288, DW_AT_decl_column(0x0e)
    4371                    $C$DW$289       .dwtag  DW_TAG_member
    4372                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$47)
    4373                            .dwattr $C$DW$289, DW_AT_name("pcName")
    4374                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("pcName")
    4375                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4376                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4377                            .dwattr $C$DW$289, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   81

    4378                            .dwattr $C$DW$289, DW_AT_decl_line(0x85)
    4379                            .dwattr $C$DW$289, DW_AT_decl_column(0x1c)
    4380                    $C$DW$290       .dwtag  DW_TAG_member
    4381                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$9)
    4382                            .dwattr $C$DW$290, DW_AT_name("usStackDepth")
    4383                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("usStackDepth")
    4384                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4385                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4386                            .dwattr $C$DW$290, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4387                            .dwattr $C$DW$290, DW_AT_decl_line(0x86)
    4388                            .dwattr $C$DW$290, DW_AT_decl_column(0x11)
    4389                    $C$DW$291       .dwtag  DW_TAG_member
    4390                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$3)
    4391                            .dwattr $C$DW$291, DW_AT_name("pvParameters")
    4392                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("pvParameters")
    4393                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4394                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4395                            .dwattr $C$DW$291, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4396                            .dwattr $C$DW$291, DW_AT_decl_line(0x87)
    4397                            .dwattr $C$DW$291, DW_AT_decl_column(0x08)
    4398                    $C$DW$292       .dwtag  DW_TAG_member
    4399                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$13)
    4400                            .dwattr $C$DW$292, DW_AT_name("uxPriority")
    4401                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("uxPriority")
    4402                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4403                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4404                            .dwattr $C$DW$292, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4405                            .dwattr $C$DW$292, DW_AT_decl_line(0x88)
    4406                            .dwattr $C$DW$292, DW_AT_decl_column(0x19)
    4407                    $C$DW$293       .dwtag  DW_TAG_member
    4408                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$28)
    4409                            .dwattr $C$DW$293, DW_AT_name("puxStackBuffer")
    4410                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("puxStackBuffer")
    4411                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4412                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4413                            .dwattr $C$DW$293, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4414                            .dwattr $C$DW$293, DW_AT_decl_line(0x89)
    4415                            .dwattr $C$DW$293, DW_AT_decl_column(0x12)
    4416                    $C$DW$294       .dwtag  DW_TAG_member
    4417                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$49)
    4418                            .dwattr $C$DW$294, DW_AT_name("xRegions")
    4419                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("xRegions")
    4420                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4421                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4422                            .dwattr $C$DW$294, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4423                            .dwattr $C$DW$294, DW_AT_decl_line(0x8a)
    4424                            .dwattr $C$DW$294, DW_AT_decl_column(0x10)
    4425                            .dwendtag $C$DW$T$50
    4426                    
    4427                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    4428                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x82)
    4429                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    4430                    $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    4431                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$50)
    4432                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   82

    4433                            .dwattr $C$DW$T$151, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inc
    4434                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x8b)
    4435                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x03)
    4436                    
    4437                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4438                            .dwattr $C$DW$T$51, DW_AT_name("xTIME_OUT")
    4439                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x08)
    4440                    $C$DW$295       .dwtag  DW_TAG_member
    4441                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$12)
    4442                            .dwattr $C$DW$295, DW_AT_name("xOverflowCount")
    4443                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("xOverflowCount")
    4444                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4445                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4446                            .dwattr $C$DW$295, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4447                            .dwattr $C$DW$295, DW_AT_decl_line(0x71)
    4448                            .dwattr $C$DW$295, DW_AT_decl_column(0x10)
    4449                    $C$DW$296       .dwtag  DW_TAG_member
    4450                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$36)
    4451                            .dwattr $C$DW$296, DW_AT_name("xTimeOnEntering")
    4452                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("xTimeOnEntering")
    4453                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4454                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4455                            .dwattr $C$DW$296, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/inclu
    4456                            .dwattr $C$DW$296, DW_AT_decl_line(0x72)
    4457                            .dwattr $C$DW$296, DW_AT_decl_column(0x10)
    4458                            .dwendtag $C$DW$T$51
    4459                    
    4460                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    4461                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x6f)
    4462                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4463                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    4464                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$51)
    4465                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4466                            .dwattr $C$DW$T$92, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_LM3S1968/Source/incl
    4467                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x73)
    4468                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
    4469                    $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    4470                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4471                            .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    4472                    $C$DW$T$94      .dwtag  DW_TAG_const_type
    4473                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    4474                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4475                    
    4476                    ;***************************************************************
    4477                    ;* DWARF CIE ENTRIES                                           *
    4478                    ;***************************************************************
    4479                    
    4480                    $C$DW$CIE       .dwcie 14
    4481                            .dwcfi  cfa_register, 13
    4482                            .dwcfi  cfa_offset, 0
    4483                            .dwcfi  undefined, 0
    4484                            .dwcfi  undefined, 1
    4485                            .dwcfi  undefined, 2
    4486                            .dwcfi  undefined, 3
    4487                            .dwcfi  same_value, 4
TI ARM Assembler PC v5.1.7 Thu Oct 02 08:28:40 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
tasks.asm                                                            PAGE   83

    4488                            .dwcfi  same_value, 5
    4489                            .dwcfi  same_value, 6
    4490                            .dwcfi  same_value, 7
    4491                            .dwcfi  same_value, 8
    4492                            .dwcfi  same_value, 9
    4493                            .dwcfi  same_value, 10
    4494                            .dwcfi  same_value, 11
    4495                            .dwcfi  undefined, 12
    4496                            .dwcfi  undefined, 13
    4497                            .dwcfi  undefined, 14
    4498                            .dwcfi  undefined, 14
    4499                            .dwcfi  undefined, 7
    4500                            .dwendentry
    4501                            .dwendtag $C$DW$CU
    4502                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 737 (89%)
Number of Thumb2 ins encoded as Thumb2 = 90 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 150


