TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Wed Dec 10 18:33:55 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/croutine.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\Project_1\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

    1629                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$11)
    1630                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1631                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    1632                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x35)
    1633                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x19)
    1634                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1635                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1636                            .dwattr $C$DW$T$12, DW_AT_name("long")
    1637                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1638                    
    1639                    $C$DW$T$77      .dwtag  DW_TAG_subroutine_type
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   31

    1640                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$12)
    1641                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1642                    $C$DW$109       .dwtag  DW_TAG_formal_parameter
    1643                            .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$3)
    1644                            .dwendtag $C$DW$T$77
    1645                    
    1646                    $C$DW$T$78      .dwtag  DW_TAG_pointer_type
    1647                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    1648                            .dwattr $C$DW$T$78, DW_AT_address_class(0x20)
    1649                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    1650                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1651                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1652                            .dwattr $C$DW$T$79, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/Free
    1653                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x66)
    1654                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x19)
    1655                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1656                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1657                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1658                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1659                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    1660                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1661                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    1662                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$13)
    1663                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    1664                    $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    1665                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    1666                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1667                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\../.
    1668                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x6a)
    1669                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x1c)
    1670                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1671                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1672                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1673                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1674                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1675                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1676                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1677                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1678                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1679                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1680                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1681                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1682                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1683                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1684                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1685                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1686                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1687                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1688                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1689                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1690                    
    1691                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1692                            .dwattr $C$DW$T$24, DW_AT_name("corCoRoutineControlBlock")
    1693                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x38)
    1694                    $C$DW$110       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   32

    1695                            .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
    1696                            .dwattr $C$DW$110, DW_AT_name("pxCoRoutineFunction")
    1697                            .dwattr $C$DW$110, DW_AT_TI_symbol_name("pxCoRoutineFunction")
    1698                            .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                            .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1700                            .dwattr $C$DW$110, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1701                            .dwattr $C$DW$110, DW_AT_decl_line(0x62)
    1702                            .dwattr $C$DW$110, DW_AT_decl_column(0x15)
    1703                    $C$DW$111       .dwtag  DW_TAG_member
    1704                            .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$23)
    1705                            .dwattr $C$DW$111, DW_AT_name("xGenericListItem")
    1706                            .dwattr $C$DW$111, DW_AT_TI_symbol_name("xGenericListItem")
    1707                            .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1708                            .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1709                            .dwattr $C$DW$111, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1710                            .dwattr $C$DW$111, DW_AT_decl_line(0x63)
    1711                            .dwattr $C$DW$111, DW_AT_decl_column(0x0f)
    1712                    $C$DW$112       .dwtag  DW_TAG_member
    1713                            .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$23)
    1714                            .dwattr $C$DW$112, DW_AT_name("xEventListItem")
    1715                            .dwattr $C$DW$112, DW_AT_TI_symbol_name("xEventListItem")
    1716                            .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1717                            .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1718                            .dwattr $C$DW$112, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1719                            .dwattr $C$DW$112, DW_AT_decl_line(0x64)
    1720                            .dwattr $C$DW$112, DW_AT_decl_column(0x0f)
    1721                    $C$DW$113       .dwtag  DW_TAG_member
    1722                            .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$13)
    1723                            .dwattr $C$DW$113, DW_AT_name("uxPriority")
    1724                            .dwattr $C$DW$113, DW_AT_TI_symbol_name("uxPriority")
    1725                            .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1726                            .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1727                            .dwattr $C$DW$113, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1728                            .dwattr $C$DW$113, DW_AT_decl_line(0x65)
    1729                            .dwattr $C$DW$113, DW_AT_decl_column(0x1a)
    1730                    $C$DW$114       .dwtag  DW_TAG_member
    1731                            .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$13)
    1732                            .dwattr $C$DW$114, DW_AT_name("uxIndex")
    1733                            .dwattr $C$DW$114, DW_AT_TI_symbol_name("uxIndex")
    1734                            .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1735                            .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1736                            .dwattr $C$DW$114, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1737                            .dwattr $C$DW$114, DW_AT_decl_line(0x66)
    1738                            .dwattr $C$DW$114, DW_AT_decl_column(0x1a)
    1739                    $C$DW$115       .dwtag  DW_TAG_member
    1740                            .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$9)
    1741                            .dwattr $C$DW$115, DW_AT_name("uxState")
    1742                            .dwattr $C$DW$115, DW_AT_TI_symbol_name("uxState")
    1743                            .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1744                            .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1745                            .dwattr $C$DW$115, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crout
    1746                            .dwattr $C$DW$115, DW_AT_decl_line(0x67)
    1747                            .dwattr $C$DW$115, DW_AT_decl_column(0x13)
    1748                            .dwendtag $C$DW$T$24
    1749                    
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   33

    1750                            .dwattr $C$DW$T$24, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crou
    1751                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x60)
    1752                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
    1753                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("corCRCB")
    1754                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$24)
    1755                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1756                            .dwattr $C$DW$T$86, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/crou
    1757                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x68)
    1758                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    1759                    $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    1760                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
    1761                            .dwattr $C$DW$T$87, DW_AT_address_class(0x20)
    1762                    
    1763                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1764                            .dwattr $C$DW$T$30, DW_AT_name("xLIST")
    1765                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
    1766                    $C$DW$116       .dwtag  DW_TAG_member
    1767                            .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$25)
    1768                            .dwattr $C$DW$116, DW_AT_name("uxNumberOfItems")
    1769                            .dwattr $C$DW$116, DW_AT_TI_symbol_name("uxNumberOfItems")
    1770                            .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                            .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1772                            .dwattr $C$DW$116, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1773                            .dwattr $C$DW$116, DW_AT_decl_line(0x88)
    1774                            .dwattr $C$DW$116, DW_AT_decl_column(0x22)
    1775                    $C$DW$117       .dwtag  DW_TAG_member
    1776                            .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$27)
    1777                            .dwattr $C$DW$117, DW_AT_name("pxIndex")
    1778                            .dwattr $C$DW$117, DW_AT_TI_symbol_name("pxIndex")
    1779                            .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1780                            .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1781                            .dwattr $C$DW$117, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1782                            .dwattr $C$DW$117, DW_AT_decl_line(0x89)
    1783                            .dwattr $C$DW$117, DW_AT_decl_column(0x17)
    1784                    $C$DW$118       .dwtag  DW_TAG_member
    1785                            .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$29)
    1786                            .dwattr $C$DW$118, DW_AT_name("xListEnd")
    1787                            .dwattr $C$DW$118, DW_AT_TI_symbol_name("xListEnd")
    1788                            .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1789                            .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1790                            .dwattr $C$DW$118, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1791                            .dwattr $C$DW$118, DW_AT_decl_line(0x8a)
    1792                            .dwattr $C$DW$118, DW_AT_decl_column(0x19)
    1793                            .dwendtag $C$DW$T$30
    1794                    
    1795                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1796                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x86)
    1797                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1798                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    1799                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1800                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    1801                            .dwattr $C$DW$T$59, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1802                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x8b)
    1803                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x03)
    1804                    $C$DW$T$60      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   34

    1805                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    1806                            .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    1807                    $C$DW$T$88      .dwtag  DW_TAG_const_type
    1808                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$60)
    1809                    
    1810                    $C$DW$T$89      .dwtag  DW_TAG_array_type
    1811                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$59)
    1812                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1813                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x28)
    1814                    $C$DW$119       .dwtag  DW_TAG_subrange_type
    1815                            .dwattr $C$DW$119, DW_AT_upper_bound(0x01)
    1816                            .dwendtag $C$DW$T$89
    1817                    
    1818                    $C$DW$T$74      .dwtag  DW_TAG_const_type
    1819                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$59)
    1820                    $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    1821                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    1822                            .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    1823                    
    1824                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1825                            .dwattr $C$DW$T$34, DW_AT_name("xLIST_ITEM")
    1826                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x14)
    1827                    $C$DW$120       .dwtag  DW_TAG_member
    1828                            .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$31)
    1829                            .dwattr $C$DW$120, DW_AT_name("xItemValue")
    1830                            .dwattr $C$DW$120, DW_AT_TI_symbol_name("xItemValue")
    1831                            .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1832                            .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1833                            .dwattr $C$DW$120, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1834                            .dwattr $C$DW$120, DW_AT_decl_line(0x73)
    1835                            .dwattr $C$DW$120, DW_AT_decl_column(0x0f)
    1836                    $C$DW$121       .dwtag  DW_TAG_member
    1837                            .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    1838                            .dwattr $C$DW$121, DW_AT_name("pxNext")
    1839                            .dwattr $C$DW$121, DW_AT_TI_symbol_name("pxNext")
    1840                            .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1841                            .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1842                            .dwattr $C$DW$121, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1843                            .dwattr $C$DW$121, DW_AT_decl_line(0x74)
    1844                            .dwattr $C$DW$121, DW_AT_decl_column(0x1f)
    1845                    $C$DW$122       .dwtag  DW_TAG_member
    1846                            .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$33)
    1847                            .dwattr $C$DW$122, DW_AT_name("pxPrevious")
    1848                            .dwattr $C$DW$122, DW_AT_TI_symbol_name("pxPrevious")
    1849                            .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1850                            .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1851                            .dwattr $C$DW$122, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1852                            .dwattr $C$DW$122, DW_AT_decl_line(0x75)
    1853                            .dwattr $C$DW$122, DW_AT_decl_column(0x1f)
    1854                    $C$DW$123       .dwtag  DW_TAG_member
    1855                            .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$3)
    1856                            .dwattr $C$DW$123, DW_AT_name("pvOwner")
    1857                            .dwattr $C$DW$123, DW_AT_TI_symbol_name("pvOwner")
    1858                            .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1859                            .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   35

    1860                            .dwattr $C$DW$123, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1861                            .dwattr $C$DW$123, DW_AT_decl_line(0x76)
    1862                            .dwattr $C$DW$123, DW_AT_decl_column(0x09)
    1863                    $C$DW$124       .dwtag  DW_TAG_member
    1864                            .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$3)
    1865                            .dwattr $C$DW$124, DW_AT_name("pvContainer")
    1866                            .dwattr $C$DW$124, DW_AT_TI_symbol_name("pvContainer")
    1867                            .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1868                            .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1869                            .dwattr $C$DW$124, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1870                            .dwattr $C$DW$124, DW_AT_decl_line(0x77)
    1871                            .dwattr $C$DW$124, DW_AT_decl_column(0x09)
    1872                            .dwendtag $C$DW$T$34
    1873                    
    1874                            .dwattr $C$DW$T$34, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1875                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x71)
    1876                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
    1877                    $C$DW$T$32      .dwtag  DW_TAG_volatile_type
    1878                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$34)
    1879                    $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1880                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1881                            .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    1882                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    1883                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$34)
    1884                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1885                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1886                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x79)
    1887                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1b)
    1888                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    1889                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$23)
    1890                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    1891                    $C$DW$T$26      .dwtag  DW_TAG_volatile_type
    1892                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$23)
    1893                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1894                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    1895                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    1896                    
    1897                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1898                            .dwattr $C$DW$T$35, DW_AT_name("xMEMORY_REGION")
    1899                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x0c)
    1900                    $C$DW$125       .dwtag  DW_TAG_member
    1901                            .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$3)
    1902                            .dwattr $C$DW$125, DW_AT_name("pvBaseAddress")
    1903                            .dwattr $C$DW$125, DW_AT_TI_symbol_name("pvBaseAddress")
    1904                            .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                            .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1906                            .dwattr $C$DW$125, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    1907                            .dwattr $C$DW$125, DW_AT_decl_line(0x7a)
    1908                            .dwattr $C$DW$125, DW_AT_decl_column(0x08)
    1909                    $C$DW$126       .dwtag  DW_TAG_member
    1910                            .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$13)
    1911                            .dwattr $C$DW$126, DW_AT_name("ulLengthInBytes")
    1912                            .dwattr $C$DW$126, DW_AT_TI_symbol_name("ulLengthInBytes")
    1913                            .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1914                            .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   36

    1915                            .dwattr $C$DW$126, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    1916                            .dwattr $C$DW$126, DW_AT_decl_line(0x7b)
    1917                            .dwattr $C$DW$126, DW_AT_decl_column(0x10)
    1918                    $C$DW$127       .dwtag  DW_TAG_member
    1919                            .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$13)
    1920                            .dwattr $C$DW$127, DW_AT_name("ulParameters")
    1921                            .dwattr $C$DW$127, DW_AT_TI_symbol_name("ulParameters")
    1922                            .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1923                            .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1924                            .dwattr $C$DW$127, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    1925                            .dwattr $C$DW$127, DW_AT_decl_line(0x7c)
    1926                            .dwattr $C$DW$127, DW_AT_decl_column(0x10)
    1927                            .dwendtag $C$DW$T$35
    1928                    
    1929                            .dwattr $C$DW$T$35, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    1930                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x78)
    1931                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1932                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1933                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$35)
    1934                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1935                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    1936                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x7d)
    1937                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x03)
    1938                    
    1939                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    1940                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1941                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1942                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x0c)
    1943                    $C$DW$128       .dwtag  DW_TAG_subrange_type
    1944                            .dwattr $C$DW$128, DW_AT_upper_bound(0x00)
    1945                            .dwendtag $C$DW$T$45
    1946                    
    1947                    
    1948                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1949                            .dwattr $C$DW$T$36, DW_AT_name("xMINI_LIST_ITEM")
    1950                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x0c)
    1951                    $C$DW$129       .dwtag  DW_TAG_member
    1952                            .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$31)
    1953                            .dwattr $C$DW$129, DW_AT_name("xItemValue")
    1954                            .dwattr $C$DW$129, DW_AT_TI_symbol_name("xItemValue")
    1955                            .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                            .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1957                            .dwattr $C$DW$129, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1958                            .dwattr $C$DW$129, DW_AT_decl_line(0x7d)
    1959                            .dwattr $C$DW$129, DW_AT_decl_column(0x0f)
    1960                    $C$DW$130       .dwtag  DW_TAG_member
    1961                            .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$33)
    1962                            .dwattr $C$DW$130, DW_AT_name("pxNext")
    1963                            .dwattr $C$DW$130, DW_AT_TI_symbol_name("pxNext")
    1964                            .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1965                            .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1966                            .dwattr $C$DW$130, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1967                            .dwattr $C$DW$130, DW_AT_decl_line(0x7e)
    1968                            .dwattr $C$DW$130, DW_AT_decl_column(0x1e)
    1969                    $C$DW$131       .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   37

    1970                            .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$33)
    1971                            .dwattr $C$DW$131, DW_AT_name("pxPrevious")
    1972                            .dwattr $C$DW$131, DW_AT_TI_symbol_name("pxPrevious")
    1973                            .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1974                            .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1975                            .dwattr $C$DW$131, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list.
    1976                            .dwattr $C$DW$131, DW_AT_decl_line(0x7f)
    1977                            .dwattr $C$DW$131, DW_AT_decl_column(0x1e)
    1978                            .dwendtag $C$DW$T$36
    1979                    
    1980                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1981                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x7b)
    1982                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    1983                    $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1984                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$36)
    1985                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1986                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\Project_1\Source\include\list
    1987                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x81)
    1988                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x20)
    1989                    $C$DW$T$29      .dwtag  DW_TAG_volatile_type
    1990                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1991                    
    1992                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1993                            .dwattr $C$DW$T$46, DW_AT_name("xTASK_PARAMTERS")
    1994                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x24)
    1995                    $C$DW$132       .dwtag  DW_TAG_member
    1996                            .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$39)
    1997                            .dwattr $C$DW$132, DW_AT_name("pvTaskCode")
    1998                            .dwattr $C$DW$132, DW_AT_TI_symbol_name("pvTaskCode")
    1999                            .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2000                            .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2001                            .dwattr $C$DW$132, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2002                            .dwattr $C$DW$132, DW_AT_decl_line(0x84)
    2003                            .dwattr $C$DW$132, DW_AT_decl_column(0x0e)
    2004                    $C$DW$133       .dwtag  DW_TAG_member
    2005                            .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$42)
    2006                            .dwattr $C$DW$133, DW_AT_name("pcName")
    2007                            .dwattr $C$DW$133, DW_AT_TI_symbol_name("pcName")
    2008                            .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2009                            .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2010                            .dwattr $C$DW$133, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2011                            .dwattr $C$DW$133, DW_AT_decl_line(0x85)
    2012                            .dwattr $C$DW$133, DW_AT_decl_column(0x1c)
    2013                    $C$DW$134       .dwtag  DW_TAG_member
    2014                            .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$9)
    2015                            .dwattr $C$DW$134, DW_AT_name("usStackDepth")
    2016                            .dwattr $C$DW$134, DW_AT_TI_symbol_name("usStackDepth")
    2017                            .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2018                            .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2019                            .dwattr $C$DW$134, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2020                            .dwattr $C$DW$134, DW_AT_decl_line(0x86)
    2021                            .dwattr $C$DW$134, DW_AT_decl_column(0x11)
    2022                    $C$DW$135       .dwtag  DW_TAG_member
    2023                            .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$3)
    2024                            .dwattr $C$DW$135, DW_AT_name("pvParameters")
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   38

    2025                            .dwattr $C$DW$135, DW_AT_TI_symbol_name("pvParameters")
    2026                            .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2027                            .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2028                            .dwattr $C$DW$135, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2029                            .dwattr $C$DW$135, DW_AT_decl_line(0x87)
    2030                            .dwattr $C$DW$135, DW_AT_decl_column(0x08)
    2031                    $C$DW$136       .dwtag  DW_TAG_member
    2032                            .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$13)
    2033                            .dwattr $C$DW$136, DW_AT_name("uxPriority")
    2034                            .dwattr $C$DW$136, DW_AT_TI_symbol_name("uxPriority")
    2035                            .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2036                            .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2037                            .dwattr $C$DW$136, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2038                            .dwattr $C$DW$136, DW_AT_decl_line(0x88)
    2039                            .dwattr $C$DW$136, DW_AT_decl_column(0x19)
    2040                    $C$DW$137       .dwtag  DW_TAG_member
    2041                            .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$43)
    2042                            .dwattr $C$DW$137, DW_AT_name("puxStackBuffer")
    2043                            .dwattr $C$DW$137, DW_AT_TI_symbol_name("puxStackBuffer")
    2044                            .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2045                            .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2046                            .dwattr $C$DW$137, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2047                            .dwattr $C$DW$137, DW_AT_decl_line(0x89)
    2048                            .dwattr $C$DW$137, DW_AT_decl_column(0x12)
    2049                    $C$DW$138       .dwtag  DW_TAG_member
    2050                            .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$45)
    2051                            .dwattr $C$DW$138, DW_AT_name("xRegions")
    2052                            .dwattr $C$DW$138, DW_AT_TI_symbol_name("xRegions")
    2053                            .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2054                            .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2055                            .dwattr $C$DW$138, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2056                            .dwattr $C$DW$138, DW_AT_decl_line(0x8a)
    2057                            .dwattr $C$DW$138, DW_AT_decl_column(0x10)
    2058                            .dwendtag $C$DW$T$46
    2059                    
    2060                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    2061                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x82)
    2062                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2063                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    2064                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$46)
    2065                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    2066                            .dwattr $C$DW$T$94, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    2067                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x8b)
    2068                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x03)
    2069                    
    2070                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2071                            .dwattr $C$DW$T$47, DW_AT_name("xTIME_OUT")
    2072                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    2073                    $C$DW$139       .dwtag  DW_TAG_member
    2074                            .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$12)
    2075                            .dwattr $C$DW$139, DW_AT_name("xOverflowCount")
    2076                            .dwattr $C$DW$139, DW_AT_TI_symbol_name("xOverflowCount")
    2077                            .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2078                            .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2079                            .dwattr $C$DW$139, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
TI ARM Assembler PC v5.1.7 Wed Dec 10 18:33:55 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
croutine.asm                                                         PAGE   39

    2080                            .dwattr $C$DW$139, DW_AT_decl_line(0x71)
    2081                            .dwattr $C$DW$139, DW_AT_decl_column(0x10)
    2082                    $C$DW$140       .dwtag  DW_TAG_member
    2083                            .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    2084                            .dwattr $C$DW$140, DW_AT_name("xTimeOnEntering")
    2085                            .dwattr $C$DW$140, DW_AT_TI_symbol_name("xTimeOnEntering")
    2086                            .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2087                            .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2088                            .dwattr $C$DW$140, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task.
    2089                            .dwattr $C$DW$140, DW_AT_decl_line(0x72)
    2090                            .dwattr $C$DW$140, DW_AT_decl_column(0x10)
    2091                            .dwendtag $C$DW$T$47
    2092                    
    2093                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    2094                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x6f)
    2095                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    2096                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    2097                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$47)
    2098                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2099                            .dwattr $C$DW$T$95, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/Project_1/Source/include/task
    2100                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x73)
    2101                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2102                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2103                    
    2104                    ;***************************************************************
    2105                    ;* DWARF CIE ENTRIES                                           *
    2106                    ;***************************************************************
    2107                    
    2108                    $C$DW$CIE       .dwcie 14
    2109                            .dwcfi  cfa_register, 13
    2110                            .dwcfi  cfa_offset, 0
    2111                            .dwcfi  undefined, 0
    2112                            .dwcfi  undefined, 1
    2113                            .dwcfi  undefined, 2
    2114                            .dwcfi  undefined, 3
    2115                            .dwcfi  same_value, 4
    2116                            .dwcfi  same_value, 5
    2117                            .dwcfi  same_value, 6
    2118                            .dwcfi  same_value, 7
    2119                            .dwcfi  same_value, 8
    2120                            .dwcfi  same_value, 9
    2121                            .dwcfi  same_value, 10
    2122                            .dwcfi  same_value, 11
    2123                            .dwcfi  undefined, 12
    2124                            .dwcfi  undefined, 13
    2125                            .dwcfi  undefined, 14
    2126                            .dwcfi  undefined, 14
    2127                            .dwcfi  undefined, 7
    2128                            .dwendentry
    2129                            .dwendtag $C$DW$CU
    2130                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 339 (90%)
Number of Thumb2 ins encoded as Thumb2 = 37 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 75


No Assembly Errors, No Assembly Warnings
