TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Nov 04 07:49:11 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/portable/CCS5/ARM_CM3/port.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ulPortSetInterruptMask")

     801                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     802                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
     803                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     804                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$11)
     805                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     806                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     807                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x35)
     808                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x19)
     809                    $C$DW$T$12      .dwtag  DW_TAG_base_type
     810                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     811                            .dwattr $C$DW$T$12, DW_AT_name("long")
     812                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
     813                    
     814                    $C$DW$T$56      .dwtag  DW_TAG_subroutine_type
     815                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$12)
     816                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
     817                    $C$DW$46        .dwtag  DW_TAG_formal_parameter
     818                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$3)
     819                            .dwendtag $C$DW$T$56
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   16

     820                    
     821                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
     822                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
     823                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
     824                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
     825                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
     826                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
     827                            .dwattr $C$DW$T$58, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/F
     828                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x66)
     829                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
     830                    $C$DW$T$13      .dwtag  DW_TAG_base_type
     831                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     832                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     833                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
     834                    $C$DW$T$19      .dwtag  DW_TAG_volatile_type
     835                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
     836                    $C$DW$T$38      .dwtag  DW_TAG_pointer_type
     837                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$13)
     838                            .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
     839                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     840                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$13)
     841                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     842                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\.
     843                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x6a)
     844                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)
     845                    $C$DW$T$14      .dwtag  DW_TAG_base_type
     846                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     847                            .dwattr $C$DW$T$14, DW_AT_name("long long")
     848                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
     849                    $C$DW$T$15      .dwtag  DW_TAG_base_type
     850                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     851                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     852                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
     853                    $C$DW$T$16      .dwtag  DW_TAG_base_type
     854                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     855                            .dwattr $C$DW$T$16, DW_AT_name("float")
     856                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
     857                    $C$DW$T$17      .dwtag  DW_TAG_base_type
     858                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     859                            .dwattr $C$DW$T$17, DW_AT_name("double")
     860                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
     861                    $C$DW$T$18      .dwtag  DW_TAG_base_type
     862                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     863                            .dwattr $C$DW$T$18, DW_AT_name("long double")
     864                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
     865                    
     866                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
     867                            .dwattr $C$DW$T$25, DW_AT_name("xLIST")
     868                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
     869                    $C$DW$47        .dwtag  DW_TAG_member
     870                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     871                            .dwattr $C$DW$47, DW_AT_name("uxNumberOfItems")
     872                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("uxNumberOfItems")
     873                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   17

     875                            .dwattr $C$DW$47, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     876                            .dwattr $C$DW$47, DW_AT_decl_line(0x88)
     877                            .dwattr $C$DW$47, DW_AT_decl_column(0x22)
     878                    $C$DW$48        .dwtag  DW_TAG_member
     879                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     880                            .dwattr $C$DW$48, DW_AT_name("pxIndex")
     881                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("pxIndex")
     882                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     883                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     884                            .dwattr $C$DW$48, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     885                            .dwattr $C$DW$48, DW_AT_decl_line(0x89)
     886                            .dwattr $C$DW$48, DW_AT_decl_column(0x17)
     887                    $C$DW$49        .dwtag  DW_TAG_member
     888                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$24)
     889                            .dwattr $C$DW$49, DW_AT_name("xListEnd")
     890                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("xListEnd")
     891                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     892                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     893                            .dwattr $C$DW$49, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     894                            .dwattr $C$DW$49, DW_AT_decl_line(0x8a)
     895                            .dwattr $C$DW$49, DW_AT_decl_column(0x19)
     896                            .dwendtag $C$DW$T$25
     897                    
     898                            .dwattr $C$DW$T$25, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
     899                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x86)
     900                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
     901                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     902                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$25)
     903                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     904                            .dwattr $C$DW$T$63, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
     905                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x8b)
     906                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x03)
     907                    
     908                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     909                            .dwattr $C$DW$T$29, DW_AT_name("xLIST_ITEM")
     910                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x14)
     911                    $C$DW$50        .dwtag  DW_TAG_member
     912                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$26)
     913                            .dwattr $C$DW$50, DW_AT_name("xItemValue")
     914                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xItemValue")
     915                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     916                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     917                            .dwattr $C$DW$50, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     918                            .dwattr $C$DW$50, DW_AT_decl_line(0x73)
     919                            .dwattr $C$DW$50, DW_AT_decl_column(0x0f)
     920                    $C$DW$51        .dwtag  DW_TAG_member
     921                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$28)
     922                            .dwattr $C$DW$51, DW_AT_name("pxNext")
     923                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("pxNext")
     924                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     925                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     926                            .dwattr $C$DW$51, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     927                            .dwattr $C$DW$51, DW_AT_decl_line(0x74)
     928                            .dwattr $C$DW$51, DW_AT_decl_column(0x1f)
     929                    $C$DW$52        .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   18

     930                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$28)
     931                            .dwattr $C$DW$52, DW_AT_name("pxPrevious")
     932                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("pxPrevious")
     933                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     934                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     935                            .dwattr $C$DW$52, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     936                            .dwattr $C$DW$52, DW_AT_decl_line(0x75)
     937                            .dwattr $C$DW$52, DW_AT_decl_column(0x1f)
     938                    $C$DW$53        .dwtag  DW_TAG_member
     939                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$3)
     940                            .dwattr $C$DW$53, DW_AT_name("pvOwner")
     941                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pvOwner")
     942                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     943                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     944                            .dwattr $C$DW$53, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     945                            .dwattr $C$DW$53, DW_AT_decl_line(0x76)
     946                            .dwattr $C$DW$53, DW_AT_decl_column(0x09)
     947                    $C$DW$54        .dwtag  DW_TAG_member
     948                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$3)
     949                            .dwattr $C$DW$54, DW_AT_name("pvContainer")
     950                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pvContainer")
     951                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     952                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     953                            .dwattr $C$DW$54, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
     954                            .dwattr $C$DW$54, DW_AT_decl_line(0x77)
     955                            .dwattr $C$DW$54, DW_AT_decl_column(0x09)
     956                            .dwendtag $C$DW$T$29
     957                    
     958                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
     959                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x71)
     960                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x08)
     961                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
     962                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
     963                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     964                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     965                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
     966                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     967                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$29)
     968                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     969                            .dwattr $C$DW$T$20, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
     970                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x79)
     971                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1b)
     972                    $C$DW$T$21      .dwtag  DW_TAG_volatile_type
     973                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
     974                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
     975                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
     976                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
     977                    
     978                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     979                            .dwattr $C$DW$T$30, DW_AT_name("xMEMORY_REGION")
     980                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x0c)
     981                    $C$DW$55        .dwtag  DW_TAG_member
     982                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$3)
     983                            .dwattr $C$DW$55, DW_AT_name("pvBaseAddress")
     984                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("pvBaseAddress")
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   19

     985                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     987                            .dwattr $C$DW$55, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
     988                            .dwattr $C$DW$55, DW_AT_decl_line(0x7a)
     989                            .dwattr $C$DW$55, DW_AT_decl_column(0x08)
     990                    $C$DW$56        .dwtag  DW_TAG_member
     991                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$13)
     992                            .dwattr $C$DW$56, DW_AT_name("ulLengthInBytes")
     993                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("ulLengthInBytes")
     994                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     995                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     996                            .dwattr $C$DW$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
     997                            .dwattr $C$DW$56, DW_AT_decl_line(0x7b)
     998                            .dwattr $C$DW$56, DW_AT_decl_column(0x10)
     999                    $C$DW$57        .dwtag  DW_TAG_member
    1000                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$13)
    1001                            .dwattr $C$DW$57, DW_AT_name("ulParameters")
    1002                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("ulParameters")
    1003                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1004                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1005                            .dwattr $C$DW$57, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1006                            .dwattr $C$DW$57, DW_AT_decl_line(0x7c)
    1007                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
    1008                            .dwendtag $C$DW$T$30
    1009                    
    1010                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1011                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x78)
    1012                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    1013                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    1014                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$30)
    1015                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1016                            .dwattr $C$DW$T$39, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1017                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x7d)
    1018                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
    1019                    
    1020                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    1021                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1022                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1023                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    1024                    $C$DW$58        .dwtag  DW_TAG_subrange_type
    1025                            .dwattr $C$DW$58, DW_AT_upper_bound(0x00)
    1026                            .dwendtag $C$DW$T$40
    1027                    
    1028                    
    1029                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1030                            .dwattr $C$DW$T$31, DW_AT_name("xMINI_LIST_ITEM")
    1031                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x0c)
    1032                    $C$DW$59        .dwtag  DW_TAG_member
    1033                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$26)
    1034                            .dwattr $C$DW$59, DW_AT_name("xItemValue")
    1035                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("xItemValue")
    1036                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1038                            .dwattr $C$DW$59, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
    1039                            .dwattr $C$DW$59, DW_AT_decl_line(0x7d)
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   20

    1040                            .dwattr $C$DW$59, DW_AT_decl_column(0x0f)
    1041                    $C$DW$60        .dwtag  DW_TAG_member
    1042                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$28)
    1043                            .dwattr $C$DW$60, DW_AT_name("pxNext")
    1044                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("pxNext")
    1045                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1046                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1047                            .dwattr $C$DW$60, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
    1048                            .dwattr $C$DW$60, DW_AT_decl_line(0x7e)
    1049                            .dwattr $C$DW$60, DW_AT_decl_column(0x1e)
    1050                    $C$DW$61        .dwtag  DW_TAG_member
    1051                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$28)
    1052                            .dwattr $C$DW$61, DW_AT_name("pxPrevious")
    1053                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("pxPrevious")
    1054                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1055                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1056                            .dwattr $C$DW$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\lis
    1057                            .dwattr $C$DW$61, DW_AT_decl_line(0x7f)
    1058                            .dwattr $C$DW$61, DW_AT_decl_column(0x1e)
    1059                            .dwendtag $C$DW$T$31
    1060                    
    1061                            .dwattr $C$DW$T$31, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
    1062                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x7b)
    1063                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x08)
    1064                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    1065                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$31)
    1066                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1067                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC\Source\include\l
    1068                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x81)
    1069                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x20)
    1070                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    1071                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1072                    
    1073                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1074                            .dwattr $C$DW$T$41, DW_AT_name("xTASK_PARAMTERS")
    1075                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x24)
    1076                    $C$DW$62        .dwtag  DW_TAG_member
    1077                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$34)
    1078                            .dwattr $C$DW$62, DW_AT_name("pvTaskCode")
    1079                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("pvTaskCode")
    1080                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1082                            .dwattr $C$DW$62, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1083                            .dwattr $C$DW$62, DW_AT_decl_line(0x84)
    1084                            .dwattr $C$DW$62, DW_AT_decl_column(0x0e)
    1085                    $C$DW$63        .dwtag  DW_TAG_member
    1086                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$37)
    1087                            .dwattr $C$DW$63, DW_AT_name("pcName")
    1088                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("pcName")
    1089                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1090                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1091                            .dwattr $C$DW$63, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1092                            .dwattr $C$DW$63, DW_AT_decl_line(0x85)
    1093                            .dwattr $C$DW$63, DW_AT_decl_column(0x1c)
    1094                    $C$DW$64        .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   21

    1095                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$9)
    1096                            .dwattr $C$DW$64, DW_AT_name("usStackDepth")
    1097                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("usStackDepth")
    1098                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1099                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1100                            .dwattr $C$DW$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1101                            .dwattr $C$DW$64, DW_AT_decl_line(0x86)
    1102                            .dwattr $C$DW$64, DW_AT_decl_column(0x11)
    1103                    $C$DW$65        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$3)
    1105                            .dwattr $C$DW$65, DW_AT_name("pvParameters")
    1106                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("pvParameters")
    1107                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1108                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1109                            .dwattr $C$DW$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1110                            .dwattr $C$DW$65, DW_AT_decl_line(0x87)
    1111                            .dwattr $C$DW$65, DW_AT_decl_column(0x08)
    1112                    $C$DW$66        .dwtag  DW_TAG_member
    1113                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$13)
    1114                            .dwattr $C$DW$66, DW_AT_name("uxPriority")
    1115                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("uxPriority")
    1116                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1117                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1118                            .dwattr $C$DW$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1119                            .dwattr $C$DW$66, DW_AT_decl_line(0x88)
    1120                            .dwattr $C$DW$66, DW_AT_decl_column(0x19)
    1121                    $C$DW$67        .dwtag  DW_TAG_member
    1122                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$38)
    1123                            .dwattr $C$DW$67, DW_AT_name("puxStackBuffer")
    1124                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("puxStackBuffer")
    1125                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1126                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1127                            .dwattr $C$DW$67, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1128                            .dwattr $C$DW$67, DW_AT_decl_line(0x89)
    1129                            .dwattr $C$DW$67, DW_AT_decl_column(0x12)
    1130                    $C$DW$68        .dwtag  DW_TAG_member
    1131                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$40)
    1132                            .dwattr $C$DW$68, DW_AT_name("xRegions")
    1133                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("xRegions")
    1134                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1135                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1136                            .dwattr $C$DW$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1137                            .dwattr $C$DW$68, DW_AT_decl_line(0x8a)
    1138                            .dwattr $C$DW$68, DW_AT_decl_column(0x10)
    1139                            .dwendtag $C$DW$T$41
    1140                    
    1141                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1142                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x82)
    1143                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    1144                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1145                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$41)
    1146                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1147                            .dwattr $C$DW$T$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1148                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x8b)
    1149                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x03)
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   22

    1150                    
    1151                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1152                            .dwattr $C$DW$T$42, DW_AT_name("xTIME_OUT")
    1153                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x08)
    1154                    $C$DW$69        .dwtag  DW_TAG_member
    1155                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$12)
    1156                            .dwattr $C$DW$69, DW_AT_name("xOverflowCount")
    1157                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("xOverflowCount")
    1158                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1160                            .dwattr $C$DW$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1161                            .dwattr $C$DW$69, DW_AT_decl_line(0x71)
    1162                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1163                    $C$DW$70        .dwtag  DW_TAG_member
    1164                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$26)
    1165                            .dwattr $C$DW$70, DW_AT_name("xTimeOnEntering")
    1166                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("xTimeOnEntering")
    1167                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1168                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1169                            .dwattr $C$DW$70, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/tas
    1170                            .dwattr $C$DW$70, DW_AT_decl_line(0x72)
    1171                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1172                            .dwendtag $C$DW$T$42
    1173                    
    1174                            .dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1175                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x6f)
    1176                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
    1177                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1178                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$42)
    1179                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1180                            .dwattr $C$DW$T$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC/Source/include/t
    1181                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x73)
    1182                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x03)
    1183                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1184                    
    1185                    ;***************************************************************
    1186                    ;* DWARF CIE ENTRIES                                           *
    1187                    ;***************************************************************
    1188                    
    1189                    $C$DW$CIE       .dwcie 14
    1190                            .dwcfi  cfa_register, 13
    1191                            .dwcfi  cfa_offset, 0
    1192                            .dwcfi  undefined, 0
    1193                            .dwcfi  undefined, 1
    1194                            .dwcfi  undefined, 2
    1195                            .dwcfi  undefined, 3
    1196                            .dwcfi  same_value, 4
    1197                            .dwcfi  same_value, 5
    1198                            .dwcfi  same_value, 6
    1199                            .dwcfi  same_value, 7
    1200                            .dwcfi  same_value, 8
    1201                            .dwcfi  same_value, 9
    1202                            .dwcfi  same_value, 10
    1203                            .dwcfi  same_value, 11
    1204                            .dwcfi  undefined, 12
TI ARM Assembler PC v5.1.7 Tue Nov 04 07:49:11 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
port.asm                                                             PAGE   23

    1205                            .dwcfi  undefined, 13
    1206                            .dwcfi  undefined, 14
    1207                            .dwcfi  undefined, 14
    1208                            .dwcfi  undefined, 7
    1209                            .dwendentry
    1210                            .dwendtag $C$DW$CU
    1211                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 82 (86%)
Number of Thumb2 ins encoded as Thumb2 = 13 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 22


No Assembly Errors, No Assembly Warnings
