TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Tue Nov 18 08:17:38 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Source/queue.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")

    2928                    $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
    2929                            .dwattr $C$DW$233, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2930                            .dwattr $C$DW$233, DW_AT_decl_line(0x90)
    2931                            .dwattr $C$DW$233, DW_AT_decl_column(0x02)
    2932                    $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
    2933                            .dwattr $C$DW$234, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2934                            .dwattr $C$DW$234, DW_AT_decl_line(0x91)
    2935                            .dwattr $C$DW$234, DW_AT_decl_column(0x02)
    2936                    $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
    2937                            .dwattr $C$DW$235, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2938                            .dwattr $C$DW$235, DW_AT_decl_line(0x92)
    2939                            .dwattr $C$DW$235, DW_AT_decl_column(0x02)
    2940                    $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
    2941                            .dwattr $C$DW$236, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2942                            .dwattr $C$DW$236, DW_AT_decl_line(0x93)
    2943                            .dwattr $C$DW$236, DW_AT_decl_column(0x02)
    2944                    $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
    2945                            .dwattr $C$DW$237, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2946                            .dwattr $C$DW$237, DW_AT_decl_line(0x94)
    2947                            .dwattr $C$DW$237, DW_AT_decl_column(0x02)
    2948                            .dwendtag $C$DW$T$50
    2949                    
    2950                            .dwattr $C$DW$T$50, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    2951                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x8f)
    2952                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2953                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
    2954                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    2955                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2956                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    2957                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x95)
    2958                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
    2959                    
    2960                    $C$DW$T$52      .dwtag  DW_TAG_enumeration_type
    2961                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2962                    $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
    2963                            .dwattr $C$DW$238, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2964                            .dwattr $C$DW$238, DW_AT_decl_line(0x9a)
    2965                            .dwattr $C$DW$238, DW_AT_decl_column(0x02)
    2966                    $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
    2967                            .dwattr $C$DW$239, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2968                            .dwattr $C$DW$239, DW_AT_decl_line(0x9b)
    2969                            .dwattr $C$DW$239, DW_AT_decl_column(0x02)
    2970                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   55

    2971                            .dwattr $C$DW$240, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    2972                            .dwattr $C$DW$240, DW_AT_decl_line(0x9c)
    2973                            .dwattr $C$DW$240, DW_AT_decl_column(0x02)
    2974                            .dwendtag $C$DW$T$52
    2975                    
    2976                            .dwattr $C$DW$T$52, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    2977                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x99)
    2978                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    2979                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
    2980                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    2981                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    2982                            .dwattr $C$DW$T$53, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    2983                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x9d)
    2984                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x03)
    2985                    
    2986                    $C$DW$T$19      .dwtag  DW_TAG_structure_type
    2987                            .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    2988                    $C$DW$241       .dwtag  DW_TAG_member
    2989                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$10)
    2990                            .dwattr $C$DW$241, DW_AT_name("quot")
    2991                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("quot")
    2992                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    2995                            .dwattr $C$DW$241, DW_AT_decl_line(0x50)
    2996                            .dwattr $C$DW$241, DW_AT_decl_column(0x16)
    2997                    $C$DW$242       .dwtag  DW_TAG_member
    2998                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$10)
    2999                            .dwattr $C$DW$242, DW_AT_name("rem")
    3000                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("rem")
    3001                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3002                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3003                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3004                            .dwattr $C$DW$242, DW_AT_decl_line(0x50)
    3005                            .dwattr $C$DW$242, DW_AT_decl_column(0x1c)
    3006                            .dwendtag $C$DW$T$19
    3007                    
    3008                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3009                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x50)
    3010                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
    3011                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3012                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3013                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3015                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x50)
    3016                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x23)
    3017                    
    3018                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3019                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
    3020                    $C$DW$243       .dwtag  DW_TAG_member
    3021                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$10)
    3022                            .dwattr $C$DW$243, DW_AT_name("quot")
    3023                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("quot")
    3024                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   56

    3026                            .dwattr $C$DW$243, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3027                            .dwattr $C$DW$243, DW_AT_decl_line(0x52)
    3028                            .dwattr $C$DW$243, DW_AT_decl_column(0x16)
    3029                    $C$DW$244       .dwtag  DW_TAG_member
    3030                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$10)
    3031                            .dwattr $C$DW$244, DW_AT_name("rem")
    3032                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("rem")
    3033                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3034                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3035                            .dwattr $C$DW$244, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3036                            .dwattr $C$DW$244, DW_AT_decl_line(0x52)
    3037                            .dwattr $C$DW$244, DW_AT_decl_column(0x1c)
    3038                            .dwendtag $C$DW$T$20
    3039                    
    3040                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3041                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x52)
    3042                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
    3043                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3044                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$20)
    3045                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    3046                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3047                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x52)
    3048                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x23)
    3049                    
    3050                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3051                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x10)
    3052                    $C$DW$245       .dwtag  DW_TAG_member
    3053                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$14)
    3054                            .dwattr $C$DW$245, DW_AT_name("quot")
    3055                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("quot")
    3056                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3057                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3058                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3059                            .dwattr $C$DW$245, DW_AT_decl_line(0x55)
    3060                            .dwattr $C$DW$245, DW_AT_decl_column(0x1c)
    3061                    $C$DW$246       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$14)
    3063                            .dwattr $C$DW$246, DW_AT_name("rem")
    3064                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("rem")
    3065                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3066                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/
    3068                            .dwattr $C$DW$246, DW_AT_decl_line(0x55)
    3069                            .dwattr $C$DW$246, DW_AT_decl_column(0x22)
    3070                            .dwendtag $C$DW$T$21
    3071                    
    3072                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3073                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x55)
    3074                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3075                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3076                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$21)
    3077                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3078                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3079                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x55)
    3080                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x29)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   57

    3081                    
    3082                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3083                            .dwattr $C$DW$T$26, DW_AT_name("QueueDefinition")
    3084                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x4c)
    3085                    $C$DW$247       .dwtag  DW_TAG_member
    3086                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$22)
    3087                            .dwattr $C$DW$247, DW_AT_name("pcHead")
    3088                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("pcHead")
    3089                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3090                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3091                            .dwattr $C$DW$247, DW_AT_decl_file("../Source/queue.c")
    3092                            .dwattr $C$DW$247, DW_AT_decl_line(0x76)
    3093                            .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    3094                    $C$DW$248       .dwtag  DW_TAG_member
    3095                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$22)
    3096                            .dwattr $C$DW$248, DW_AT_name("pcTail")
    3097                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("pcTail")
    3098                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3099                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3100                            .dwattr $C$DW$248, DW_AT_decl_file("../Source/queue.c")
    3101                            .dwattr $C$DW$248, DW_AT_decl_line(0x77)
    3102                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    3103                    $C$DW$249       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    3105                            .dwattr $C$DW$249, DW_AT_name("pcWriteTo")
    3106                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("pcWriteTo")
    3107                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3108                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$249, DW_AT_decl_file("../Source/queue.c")
    3110                            .dwattr $C$DW$249, DW_AT_decl_line(0x79)
    3111                            .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    3112                    $C$DW$250       .dwtag  DW_TAG_member
    3113                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    3114                            .dwattr $C$DW$250, DW_AT_name("pcReadFrom")
    3115                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("pcReadFrom")
    3116                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3117                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3118                            .dwattr $C$DW$250, DW_AT_decl_file("../Source/queue.c")
    3119                            .dwattr $C$DW$250, DW_AT_decl_line(0x7a)
    3120                            .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    3121                    $C$DW$251       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$23)
    3123                            .dwattr $C$DW$251, DW_AT_name("xTasksWaitingToSend")
    3124                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("xTasksWaitingToSend")
    3125                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3126                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$251, DW_AT_decl_file("../Source/queue.c")
    3128                            .dwattr $C$DW$251, DW_AT_decl_line(0x7c)
    3129                            .dwattr $C$DW$251, DW_AT_decl_column(0x08)
    3130                    $C$DW$252       .dwtag  DW_TAG_member
    3131                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$23)
    3132                            .dwattr $C$DW$252, DW_AT_name("xTasksWaitingToReceive")
    3133                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("xTasksWaitingToReceive")
    3134                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3135                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   58

    3136                            .dwattr $C$DW$252, DW_AT_decl_file("../Source/queue.c")
    3137                            .dwattr $C$DW$252, DW_AT_decl_line(0x7d)
    3138                            .dwattr $C$DW$252, DW_AT_decl_column(0x08)
    3139                    $C$DW$253       .dwtag  DW_TAG_member
    3140                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$24)
    3141                            .dwattr $C$DW$253, DW_AT_name("uxMessagesWaiting")
    3142                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("uxMessagesWaiting")
    3143                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3144                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3145                            .dwattr $C$DW$253, DW_AT_decl_file("../Source/queue.c")
    3146                            .dwattr $C$DW$253, DW_AT_decl_line(0x7f)
    3147                            .dwattr $C$DW$253, DW_AT_decl_column(0x22)
    3148                    $C$DW$254       .dwtag  DW_TAG_member
    3149                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$13)
    3150                            .dwattr $C$DW$254, DW_AT_name("uxLength")
    3151                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("uxLength")
    3152                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3153                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3154                            .dwattr $C$DW$254, DW_AT_decl_file("../Source/queue.c")
    3155                            .dwattr $C$DW$254, DW_AT_decl_line(0x80)
    3156                            .dwattr $C$DW$254, DW_AT_decl_column(0x19)
    3157                    $C$DW$255       .dwtag  DW_TAG_member
    3158                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$13)
    3159                            .dwattr $C$DW$255, DW_AT_name("uxItemSize")
    3160                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("uxItemSize")
    3161                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3162                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3163                            .dwattr $C$DW$255, DW_AT_decl_file("../Source/queue.c")
    3164                            .dwattr $C$DW$255, DW_AT_decl_line(0x81)
    3165                            .dwattr $C$DW$255, DW_AT_decl_column(0x19)
    3166                    $C$DW$256       .dwtag  DW_TAG_member
    3167                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$25)
    3168                            .dwattr $C$DW$256, DW_AT_name("xRxLock")
    3169                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("xRxLock")
    3170                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3171                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3172                            .dwattr $C$DW$256, DW_AT_decl_file("../Source/queue.c")
    3173                            .dwattr $C$DW$256, DW_AT_decl_line(0x83)
    3174                            .dwattr $C$DW$256, DW_AT_decl_column(0x20)
    3175                    $C$DW$257       .dwtag  DW_TAG_member
    3176                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$25)
    3177                            .dwattr $C$DW$257, DW_AT_name("xTxLock")
    3178                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("xTxLock")
    3179                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3180                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3181                            .dwattr $C$DW$257, DW_AT_decl_file("../Source/queue.c")
    3182                            .dwattr $C$DW$257, DW_AT_decl_line(0x84)
    3183                            .dwattr $C$DW$257, DW_AT_decl_column(0x20)
    3184                            .dwendtag $C$DW$T$26
    3185                    
    3186                            .dwattr $C$DW$T$26, DW_AT_decl_file("../Source/queue.c")
    3187                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x74)
    3188                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    3189                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("xQUEUE")
    3190                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$26)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   59

    3191                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    3192                            .dwattr $C$DW$T$57, DW_AT_decl_file("../Source/queue.c")
    3193                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x8f)
    3194                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    3195                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    3196                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    3197                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    3198                    $C$DW$T$59      .dwtag  DW_TAG_const_type
    3199                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    3200                    $C$DW$T$60      .dwtag  DW_TAG_const_type
    3201                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$57)
    3202                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    3203                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    3204                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    3205                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3206                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3207                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3208                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3209                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3210                    $C$DW$T$68      .dwtag  DW_TAG_const_type
    3211                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$3)
    3212                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueHandle")
    3213                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$3)
    3214                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    3215                            .dwattr $C$DW$T$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3216                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x5f)
    3217                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    3218                    $C$DW$T$71      .dwtag  DW_TAG_const_type
    3219                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$69)
    3220                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetHandle")
    3221                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$3)
    3222                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3223                            .dwattr $C$DW$T$72, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3224                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x66)
    3225                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x10)
    3226                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("xQueueSetMemberHandle")
    3227                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$3)
    3228                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3229                            .dwattr $C$DW$T$73, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3230                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x6d)
    3231                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x10)
    3232                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
    3233                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$3)
    3234                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3235                            .dwattr $C$DW$T$74, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3236                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x6a)
    3237                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x10)
    3238                    
    3239                    $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    3240                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3241                    $C$DW$258       .dwtag  DW_TAG_formal_parameter
    3242                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$3)
    3243                            .dwendtag $C$DW$T$39
    3244                    
    3245                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   60

    3246                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3247                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3248                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
    3249                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3250                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3251                            .dwattr $C$DW$T$41, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3252                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x4f)
    3253                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3254                    $C$DW$T$62      .dwtag  DW_TAG_const_type
    3255                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$2)
    3256                    $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    3257                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    3258                            .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    3259                    $C$DW$T$75      .dwtag  DW_TAG_const_type
    3260                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$63)
    3261                    
    3262                    $C$DW$T$76      .dwtag  DW_TAG_subroutine_type
    3263                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3264                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    3265                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    3266                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    3267                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("__TI_atexit_fn")
    3268                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
    3269                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3270                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3271                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xa3)
    3272                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x14)
    3273                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3274                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3275                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3276                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3277                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3278                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3279                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3280                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3281                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3282                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$5)
    3283                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3284                    $C$DW$T$42      .dwtag  DW_TAG_const_type
    3285                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$5)
    3286                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3287                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    3288                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3289                    $C$DW$T$44      .dwtag  DW_TAG_const_type
    3290                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3291                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3292                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3293                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3294                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3295                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3296                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3297                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3298                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3299                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3300                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   61

    3301                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3302                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3303                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3304                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3305                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3306                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3307                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3308                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$9)
    3309                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3310                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3311                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x6a)
    3312                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x1a)
    3313                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3314                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3315                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3316                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3317                    
    3318                    $C$DW$T$102     .dwtag  DW_TAG_subroutine_type
    3319                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$10)
    3320                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3321                    $C$DW$259       .dwtag  DW_TAG_formal_parameter
    3322                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$63)
    3323                    $C$DW$260       .dwtag  DW_TAG_formal_parameter
    3324                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$63)
    3325                            .dwendtag $C$DW$T$102
    3326                    
    3327                    $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    3328                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$102)
    3329                            .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    3330                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("__TI_compar_fn")
    3331                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$103)
    3332                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3333                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3334                            .dwattr $C$DW$T$104, DW_AT_decl_line(0xa6)
    3335                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x13)
    3336                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
    3337                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$10)
    3338                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3339                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/includ
    3340                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x31)
    3341                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x1c)
    3342                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3343                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3344                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3345                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3346                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3347                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$11)
    3348                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3349                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
    3350                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x64)
    3351                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x19)
    3352                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    3353                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3354                            .dwattr $C$DW$T$12, DW_AT_name("long")
    3355                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   62

    3356                    $C$DW$T$25      .dwtag  DW_TAG_volatile_type
    3357                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$12)
    3358                    $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3359                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$12)
    3360                            .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3361                    
    3362                    $C$DW$T$124     .dwtag  DW_TAG_subroutine_type
    3363                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$12)
    3364                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    3365                    $C$DW$261       .dwtag  DW_TAG_formal_parameter
    3366                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$3)
    3367                            .dwendtag $C$DW$T$124
    3368                    
    3369                    $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    3370                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$124)
    3371                            .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    3372                    $C$DW$T$126     .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
    3373                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$125)
    3374                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    3375                            .dwattr $C$DW$T$126, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inc
    3376                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x66)
    3377                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x19)
    3378                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    3379                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3380                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3381                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3382                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
    3383                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$13)
    3384                    $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    3385                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$13)
    3386                            .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    3387                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
    3388                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$13)
    3389                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3390                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3391                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x6a)
    3392                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1c)
    3393                    $C$DW$T$110     .dwtag  DW_TAG_pointer_type
    3394                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$33)
    3395                            .dwattr $C$DW$T$110, DW_AT_address_class(0x20)
    3396                    $C$DW$T$111     .dwtag  DW_TAG_const_type
    3397                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
    3398                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    3399                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3400                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    3401                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3402                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    3403                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3404                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3405                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3406                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    3407                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3408                            .dwattr $C$DW$T$16, DW_AT_name("float")
    3409                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3410                    $C$DW$T$17      .dwtag  DW_TAG_base_type
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   63

    3411                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3412                            .dwattr $C$DW$T$17, DW_AT_name("double")
    3413                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    3414                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    3415                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3416                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    3417                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    3418                    
    3419                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3420                            .dwattr $C$DW$T$32, DW_AT_name("xLIST")
    3421                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
    3422                    $C$DW$262       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$24)
    3424                            .dwattr $C$DW$262, DW_AT_name("uxNumberOfItems")
    3425                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("uxNumberOfItems")
    3426                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3427                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$262, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3429                            .dwattr $C$DW$262, DW_AT_decl_line(0x88)
    3430                            .dwattr $C$DW$262, DW_AT_decl_column(0x22)
    3431                    $C$DW$263       .dwtag  DW_TAG_member
    3432                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$29)
    3433                            .dwattr $C$DW$263, DW_AT_name("pxIndex")
    3434                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("pxIndex")
    3435                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3436                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3437                            .dwattr $C$DW$263, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3438                            .dwattr $C$DW$263, DW_AT_decl_line(0x89)
    3439                            .dwattr $C$DW$263, DW_AT_decl_column(0x17)
    3440                    $C$DW$264       .dwtag  DW_TAG_member
    3441                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    3442                            .dwattr $C$DW$264, DW_AT_name("xListEnd")
    3443                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("xListEnd")
    3444                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3445                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3446                            .dwattr $C$DW$264, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3447                            .dwattr $C$DW$264, DW_AT_decl_line(0x8a)
    3448                            .dwattr $C$DW$264, DW_AT_decl_column(0x19)
    3449                            .dwendtag $C$DW$T$32
    3450                    
    3451                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3452                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x86)
    3453                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3454                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
    3455                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
    3456                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3457                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3458                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x8b)
    3459                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x03)
    3460                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    3461                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$23)
    3462                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    3463                    $C$DW$T$84      .dwtag  DW_TAG_const_type
    3464                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$23)
    3465                    $C$DW$T$85      .dwtag  DW_TAG_pointer_type
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   64

    3466                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3467                            .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    3468                    $C$DW$T$86      .dwtag  DW_TAG_const_type
    3469                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3470                    
    3471                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3472                            .dwattr $C$DW$T$36, DW_AT_name("xLIST_ITEM")
    3473                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
    3474                    $C$DW$265       .dwtag  DW_TAG_member
    3475                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$33)
    3476                            .dwattr $C$DW$265, DW_AT_name("xItemValue")
    3477                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("xItemValue")
    3478                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3479                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3480                            .dwattr $C$DW$265, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3481                            .dwattr $C$DW$265, DW_AT_decl_line(0x73)
    3482                            .dwattr $C$DW$265, DW_AT_decl_column(0x0f)
    3483                    $C$DW$266       .dwtag  DW_TAG_member
    3484                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$35)
    3485                            .dwattr $C$DW$266, DW_AT_name("pxNext")
    3486                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("pxNext")
    3487                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3488                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3489                            .dwattr $C$DW$266, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3490                            .dwattr $C$DW$266, DW_AT_decl_line(0x74)
    3491                            .dwattr $C$DW$266, DW_AT_decl_column(0x1f)
    3492                    $C$DW$267       .dwtag  DW_TAG_member
    3493                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$35)
    3494                            .dwattr $C$DW$267, DW_AT_name("pxPrevious")
    3495                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("pxPrevious")
    3496                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3497                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3498                            .dwattr $C$DW$267, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3499                            .dwattr $C$DW$267, DW_AT_decl_line(0x75)
    3500                            .dwattr $C$DW$267, DW_AT_decl_column(0x1f)
    3501                    $C$DW$268       .dwtag  DW_TAG_member
    3502                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$3)
    3503                            .dwattr $C$DW$268, DW_AT_name("pvOwner")
    3504                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("pvOwner")
    3505                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3506                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3507                            .dwattr $C$DW$268, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3508                            .dwattr $C$DW$268, DW_AT_decl_line(0x76)
    3509                            .dwattr $C$DW$268, DW_AT_decl_column(0x09)
    3510                    $C$DW$269       .dwtag  DW_TAG_member
    3511                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$3)
    3512                            .dwattr $C$DW$269, DW_AT_name("pvContainer")
    3513                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("pvContainer")
    3514                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3515                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3516                            .dwattr $C$DW$269, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3517                            .dwattr $C$DW$269, DW_AT_decl_line(0x77)
    3518                            .dwattr $C$DW$269, DW_AT_decl_column(0x09)
    3519                            .dwendtag $C$DW$T$36
    3520                    
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   65

    3521                            .dwattr $C$DW$T$36, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3522                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x71)
    3523                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x08)
    3524                    $C$DW$T$34      .dwtag  DW_TAG_volatile_type
    3525                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$36)
    3526                    $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    3527                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3528                            .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    3529                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
    3530                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$36)
    3531                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3532                            .dwattr $C$DW$T$27, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3533                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x79)
    3534                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1b)
    3535                    $C$DW$T$28      .dwtag  DW_TAG_volatile_type
    3536                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3537                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3538                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3539                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3540                    
    3541                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3542                            .dwattr $C$DW$T$37, DW_AT_name("xMEMORY_REGION")
    3543                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x0c)
    3544                    $C$DW$270       .dwtag  DW_TAG_member
    3545                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$3)
    3546                            .dwattr $C$DW$270, DW_AT_name("pvBaseAddress")
    3547                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("pvBaseAddress")
    3548                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3549                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3550                            .dwattr $C$DW$270, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3551                            .dwattr $C$DW$270, DW_AT_decl_line(0x7a)
    3552                            .dwattr $C$DW$270, DW_AT_decl_column(0x08)
    3553                    $C$DW$271       .dwtag  DW_TAG_member
    3554                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$13)
    3555                            .dwattr $C$DW$271, DW_AT_name("ulLengthInBytes")
    3556                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("ulLengthInBytes")
    3557                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3558                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3559                            .dwattr $C$DW$271, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3560                            .dwattr $C$DW$271, DW_AT_decl_line(0x7b)
    3561                            .dwattr $C$DW$271, DW_AT_decl_column(0x10)
    3562                    $C$DW$272       .dwtag  DW_TAG_member
    3563                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$13)
    3564                            .dwattr $C$DW$272, DW_AT_name("ulParameters")
    3565                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("ulParameters")
    3566                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3567                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3568                            .dwattr $C$DW$272, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3569                            .dwattr $C$DW$272, DW_AT_decl_line(0x7c)
    3570                            .dwattr $C$DW$272, DW_AT_decl_column(0x10)
    3571                            .dwendtag $C$DW$T$37
    3572                    
    3573                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3574                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x78)
    3575                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   66

    3576                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
    3577                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$37)
    3578                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3579                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3580                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x7d)
    3581                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x03)
    3582                    
    3583                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    3584                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3585                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3586                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
    3587                    $C$DW$273       .dwtag  DW_TAG_subrange_type
    3588                            .dwattr $C$DW$273, DW_AT_upper_bound(0x00)
    3589                            .dwendtag $C$DW$T$47
    3590                    
    3591                    
    3592                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3593                            .dwattr $C$DW$T$38, DW_AT_name("xMINI_LIST_ITEM")
    3594                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x0c)
    3595                    $C$DW$274       .dwtag  DW_TAG_member
    3596                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$33)
    3597                            .dwattr $C$DW$274, DW_AT_name("xItemValue")
    3598                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("xItemValue")
    3599                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3600                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3601                            .dwattr $C$DW$274, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3602                            .dwattr $C$DW$274, DW_AT_decl_line(0x7d)
    3603                            .dwattr $C$DW$274, DW_AT_decl_column(0x0f)
    3604                    $C$DW$275       .dwtag  DW_TAG_member
    3605                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$35)
    3606                            .dwattr $C$DW$275, DW_AT_name("pxNext")
    3607                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("pxNext")
    3608                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3609                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3610                            .dwattr $C$DW$275, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3611                            .dwattr $C$DW$275, DW_AT_decl_line(0x7e)
    3612                            .dwattr $C$DW$275, DW_AT_decl_column(0x1e)
    3613                    $C$DW$276       .dwtag  DW_TAG_member
    3614                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$35)
    3615                            .dwattr $C$DW$276, DW_AT_name("pxPrevious")
    3616                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("pxPrevious")
    3617                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3618                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3619                            .dwattr $C$DW$276, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\inclu
    3620                            .dwattr $C$DW$276, DW_AT_decl_line(0x7f)
    3621                            .dwattr $C$DW$276, DW_AT_decl_column(0x1e)
    3622                            .dwendtag $C$DW$T$38
    3623                    
    3624                            .dwattr $C$DW$T$38, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
    3625                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x7b)
    3626                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    3627                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
    3628                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$38)
    3629                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3630                            .dwattr $C$DW$T$30, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_ADC_Lab7\Source\incl
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   67

    3631                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x81)
    3632                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x20)
    3633                    $C$DW$T$31      .dwtag  DW_TAG_volatile_type
    3634                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    3635                    
    3636                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3637                            .dwattr $C$DW$T$48, DW_AT_name("xTASK_PARAMTERS")
    3638                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x24)
    3639                    $C$DW$277       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$41)
    3641                            .dwattr $C$DW$277, DW_AT_name("pvTaskCode")
    3642                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("pvTaskCode")
    3643                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3644                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$277, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3646                            .dwattr $C$DW$277, DW_AT_decl_line(0x84)
    3647                            .dwattr $C$DW$277, DW_AT_decl_column(0x0e)
    3648                    $C$DW$278       .dwtag  DW_TAG_member
    3649                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$44)
    3650                            .dwattr $C$DW$278, DW_AT_name("pcName")
    3651                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("pcName")
    3652                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3653                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3654                            .dwattr $C$DW$278, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3655                            .dwattr $C$DW$278, DW_AT_decl_line(0x85)
    3656                            .dwattr $C$DW$278, DW_AT_decl_column(0x1c)
    3657                    $C$DW$279       .dwtag  DW_TAG_member
    3658                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$9)
    3659                            .dwattr $C$DW$279, DW_AT_name("usStackDepth")
    3660                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("usStackDepth")
    3661                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3662                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3663                            .dwattr $C$DW$279, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3664                            .dwattr $C$DW$279, DW_AT_decl_line(0x86)
    3665                            .dwattr $C$DW$279, DW_AT_decl_column(0x11)
    3666                    $C$DW$280       .dwtag  DW_TAG_member
    3667                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$3)
    3668                            .dwattr $C$DW$280, DW_AT_name("pvParameters")
    3669                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("pvParameters")
    3670                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3671                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3672                            .dwattr $C$DW$280, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3673                            .dwattr $C$DW$280, DW_AT_decl_line(0x87)
    3674                            .dwattr $C$DW$280, DW_AT_decl_column(0x08)
    3675                    $C$DW$281       .dwtag  DW_TAG_member
    3676                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$13)
    3677                            .dwattr $C$DW$281, DW_AT_name("uxPriority")
    3678                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("uxPriority")
    3679                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3680                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$281, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3682                            .dwattr $C$DW$281, DW_AT_decl_line(0x88)
    3683                            .dwattr $C$DW$281, DW_AT_decl_column(0x19)
    3684                    $C$DW$282       .dwtag  DW_TAG_member
    3685                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   68

    3686                            .dwattr $C$DW$282, DW_AT_name("puxStackBuffer")
    3687                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("puxStackBuffer")
    3688                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3689                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3690                            .dwattr $C$DW$282, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3691                            .dwattr $C$DW$282, DW_AT_decl_line(0x89)
    3692                            .dwattr $C$DW$282, DW_AT_decl_column(0x12)
    3693                    $C$DW$283       .dwtag  DW_TAG_member
    3694                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$47)
    3695                            .dwattr $C$DW$283, DW_AT_name("xRegions")
    3696                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("xRegions")
    3697                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3698                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3699                            .dwattr $C$DW$283, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3700                            .dwattr $C$DW$283, DW_AT_decl_line(0x8a)
    3701                            .dwattr $C$DW$283, DW_AT_decl_column(0x10)
    3702                            .dwendtag $C$DW$T$48
    3703                    
    3704                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3705                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x82)
    3706                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    3707                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    3708                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$48)
    3709                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3710                            .dwattr $C$DW$T$132, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inc
    3711                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x8b)
    3712                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x03)
    3713                    
    3714                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3715                            .dwattr $C$DW$T$49, DW_AT_name("xTIME_OUT")
    3716                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
    3717                    $C$DW$284       .dwtag  DW_TAG_member
    3718                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$12)
    3719                            .dwattr $C$DW$284, DW_AT_name("xOverflowCount")
    3720                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("xOverflowCount")
    3721                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3722                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3723                            .dwattr $C$DW$284, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3724                            .dwattr $C$DW$284, DW_AT_decl_line(0x71)
    3725                            .dwattr $C$DW$284, DW_AT_decl_column(0x10)
    3726                    $C$DW$285       .dwtag  DW_TAG_member
    3727                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$33)
    3728                            .dwattr $C$DW$285, DW_AT_name("xTimeOnEntering")
    3729                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("xTimeOnEntering")
    3730                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3731                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3732                            .dwattr $C$DW$285, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/inclu
    3733                            .dwattr $C$DW$285, DW_AT_decl_line(0x72)
    3734                            .dwattr $C$DW$285, DW_AT_decl_column(0x10)
    3735                            .dwendtag $C$DW$T$49
    3736                    
    3737                            .dwattr $C$DW$T$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3738                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x6f)
    3739                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    3740                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
TI ARM Assembler PC v5.1.7 Tue Nov 18 08:17:38 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
queue.asm                                                            PAGE   69

    3741                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$49)
    3742                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3743                            .dwattr $C$DW$T$89, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_ADC_Lab7/Source/incl
    3744                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x73)
    3745                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x03)
    3746                    $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3747                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3748                            .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    3749                    $C$DW$T$91      .dwtag  DW_TAG_const_type
    3750                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    3751                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3752                    
    3753                    ;***************************************************************
    3754                    ;* DWARF CIE ENTRIES                                           *
    3755                    ;***************************************************************
    3756                    
    3757                    $C$DW$CIE       .dwcie 14
    3758                            .dwcfi  cfa_register, 13
    3759                            .dwcfi  cfa_offset, 0
    3760                            .dwcfi  undefined, 0
    3761                            .dwcfi  undefined, 1
    3762                            .dwcfi  undefined, 2
    3763                            .dwcfi  undefined, 3
    3764                            .dwcfi  same_value, 4
    3765                            .dwcfi  same_value, 5
    3766                            .dwcfi  same_value, 6
    3767                            .dwcfi  same_value, 7
    3768                            .dwcfi  same_value, 8
    3769                            .dwcfi  same_value, 9
    3770                            .dwcfi  same_value, 10
    3771                            .dwcfi  same_value, 11
    3772                            .dwcfi  undefined, 12
    3773                            .dwcfi  undefined, 13
    3774                            .dwcfi  undefined, 14
    3775                            .dwcfi  undefined, 14
    3776                            .dwcfi  undefined, 7
    3777                            .dwendentry
    3778                            .dwendtag $C$DW$CU
    3779                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 598 (85%)
Number of Thumb2 ins encoded as Thumb2 = 102 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 124


