TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                             PC v5.1.7 *
       3                    ;* Date/Time created: Thu Dec 11 12:34:53 2014                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --disable_dual_state --
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Task_AsmCompute.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v5.1.7 Copyright (c) 1996-2014 Te
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("UARTprintf")

     442                    $C$DW$31        .dwtag  DW_TAG_enumerator, DW_AT_name("eRunning"), DW_AT_const_value(0x00)
     443                            .dwattr $C$DW$31, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     444                            .dwattr $C$DW$31, DW_AT_decl_line(0x90)
     445                            .dwattr $C$DW$31, DW_AT_decl_column(0x02)
     446                    $C$DW$32        .dwtag  DW_TAG_enumerator, DW_AT_name("eReady"), DW_AT_const_value(0x01)
     447                            .dwattr $C$DW$32, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     448                            .dwattr $C$DW$32, DW_AT_decl_line(0x91)
     449                            .dwattr $C$DW$32, DW_AT_decl_column(0x02)
     450                    $C$DW$33        .dwtag  DW_TAG_enumerator, DW_AT_name("eBlocked"), DW_AT_const_value(0x02)
     451                            .dwattr $C$DW$33, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     452                            .dwattr $C$DW$33, DW_AT_decl_line(0x92)
     453                            .dwattr $C$DW$33, DW_AT_decl_column(0x02)
     454                    $C$DW$34        .dwtag  DW_TAG_enumerator, DW_AT_name("eSuspended"), DW_AT_const_value(0x03)
     455                            .dwattr $C$DW$34, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     456                            .dwattr $C$DW$34, DW_AT_decl_line(0x93)
     457                            .dwattr $C$DW$34, DW_AT_decl_column(0x02)
     458                    $C$DW$35        .dwtag  DW_TAG_enumerator, DW_AT_name("eDeleted"), DW_AT_const_value(0x04)
     459                            .dwattr $C$DW$35, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     460                            .dwattr $C$DW$35, DW_AT_decl_line(0x94)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   12

     461                            .dwattr $C$DW$35, DW_AT_decl_column(0x02)
     462                            .dwendtag $C$DW$T$46
     463                    
     464                            .dwattr $C$DW$T$46, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     465                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x8f)
     466                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
     467                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("eTaskState")
     468                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
     469                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     470                            .dwattr $C$DW$T$47, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     471                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x95)
     472                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
     473                    
     474                    $C$DW$T$48      .dwtag  DW_TAG_enumeration_type
     475                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
     476                    $C$DW$36        .dwtag  DW_TAG_enumerator, DW_AT_name("eAbortSleep"), DW_AT_const_value(0x00)
     477                            .dwattr $C$DW$36, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     478                            .dwattr $C$DW$36, DW_AT_decl_line(0x9a)
     479                            .dwattr $C$DW$36, DW_AT_decl_column(0x02)
     480                    $C$DW$37        .dwtag  DW_TAG_enumerator, DW_AT_name("eStandardSleep"), DW_AT_const_value(0x01)
     481                            .dwattr $C$DW$37, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     482                            .dwattr $C$DW$37, DW_AT_decl_line(0x9b)
     483                            .dwattr $C$DW$37, DW_AT_decl_column(0x02)
     484                    $C$DW$38        .dwtag  DW_TAG_enumerator, DW_AT_name("eNoTasksWaitingTimeout"), DW_AT_const_value(0x0
     485                            .dwattr $C$DW$38, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     486                            .dwattr $C$DW$38, DW_AT_decl_line(0x9c)
     487                            .dwattr $C$DW$38, DW_AT_decl_column(0x02)
     488                            .dwendtag $C$DW$T$48
     489                    
     490                            .dwattr $C$DW$T$48, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     491                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x99)
     492                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
     493                    $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("eSleepModeStatus")
     494                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     495                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
     496                            .dwattr $C$DW$T$49, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     497                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x9d)
     498                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x03)
     499                    
     500                    $C$DW$T$20      .dwtag  DW_TAG_structure_type
     501                            .dwattr $C$DW$T$20, DW_AT_byte_size(0x18)
     502                    $C$DW$39        .dwtag  DW_TAG_member
     503                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$10)
     504                            .dwattr $C$DW$39, DW_AT_name("fd")
     505                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("fd")
     506                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     508                            .dwattr $C$DW$39, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     509                            .dwattr $C$DW$39, DW_AT_decl_line(0x5b)
     510                            .dwattr $C$DW$39, DW_AT_decl_column(0x0b)
     511                    $C$DW$40        .dwtag  DW_TAG_member
     512                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     513                            .dwattr $C$DW$40, DW_AT_name("buf")
     514                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("buf")
     515                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   13

     516                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     517                            .dwattr $C$DW$40, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     518                            .dwattr $C$DW$40, DW_AT_decl_line(0x5c)
     519                            .dwattr $C$DW$40, DW_AT_decl_column(0x16)
     520                    $C$DW$41        .dwtag  DW_TAG_member
     521                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     522                            .dwattr $C$DW$41, DW_AT_name("pos")
     523                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("pos")
     524                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     525                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     526                            .dwattr $C$DW$41, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     527                            .dwattr $C$DW$41, DW_AT_decl_line(0x5d)
     528                            .dwattr $C$DW$41, DW_AT_decl_column(0x16)
     529                    $C$DW$42        .dwtag  DW_TAG_member
     530                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     531                            .dwattr $C$DW$42, DW_AT_name("bufend")
     532                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("bufend")
     533                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     534                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     535                            .dwattr $C$DW$42, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     536                            .dwattr $C$DW$42, DW_AT_decl_line(0x5e)
     537                            .dwattr $C$DW$42, DW_AT_decl_column(0x16)
     538                    $C$DW$43        .dwtag  DW_TAG_member
     539                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     540                            .dwattr $C$DW$43, DW_AT_name("buff_stop")
     541                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("buff_stop")
     542                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     543                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     544                            .dwattr $C$DW$43, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     545                            .dwattr $C$DW$43, DW_AT_decl_line(0x5f)
     546                            .dwattr $C$DW$43, DW_AT_decl_column(0x16)
     547                    $C$DW$44        .dwtag  DW_TAG_member
     548                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     549                            .dwattr $C$DW$44, DW_AT_name("flags")
     550                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("flags")
     551                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     552                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     553                            .dwattr $C$DW$44, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     554                            .dwattr $C$DW$44, DW_AT_decl_line(0x60)
     555                            .dwattr $C$DW$44, DW_AT_decl_column(0x16)
     556                            .dwendtag $C$DW$T$20
     557                    
     558                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     559                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x5a)
     560                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
     561                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
     562                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     563                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
     564                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     565                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x61)
     566                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
     567                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
     568                            .dwattr $C$DW$T$2, DW_AT_name("void")
     569                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
     570                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   14

     571                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
     572                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskHandle")
     573                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$3)
     574                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
     575                            .dwattr $C$DW$T$51, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     576                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x6a)
     577                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
     578                    
     579                    $C$DW$T$35      .dwtag  DW_TAG_subroutine_type
     580                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
     581                    $C$DW$45        .dwtag  DW_TAG_formal_parameter
     582                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$3)
     583                            .dwendtag $C$DW$T$35
     584                    
     585                    $C$DW$T$36      .dwtag  DW_TAG_pointer_type
     586                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     587                            .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
     588                    $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_CODE")
     589                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
     590                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     591                            .dwattr $C$DW$T$37, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     592                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x4f)
     593                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
     594                    $C$DW$T$4       .dwtag  DW_TAG_base_type
     595                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     596                            .dwattr $C$DW$T$4, DW_AT_name("bool")
     597                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     598                    $C$DW$T$5       .dwtag  DW_TAG_base_type
     599                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     600                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
     601                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     602                    $C$DW$T$38      .dwtag  DW_TAG_const_type
     603                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$5)
     604                    $C$DW$T$39      .dwtag  DW_TAG_pointer_type
     605                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
     606                            .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
     607                    $C$DW$T$40      .dwtag  DW_TAG_const_type
     608                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
     609                    $C$DW$T$6       .dwtag  DW_TAG_base_type
     610                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     611                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     612                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     613                    $C$DW$T$19      .dwtag  DW_TAG_pointer_type
     614                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
     615                            .dwattr $C$DW$T$19, DW_AT_address_class(0x20)
     616                    $C$DW$T$7       .dwtag  DW_TAG_base_type
     617                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     618                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     619                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
     620                    $C$DW$T$8       .dwtag  DW_TAG_base_type
     621                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     622                            .dwattr $C$DW$T$8, DW_AT_name("short")
     623                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
     624                    $C$DW$T$9       .dwtag  DW_TAG_base_type
     625                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   15

     626                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     627                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
     628                    $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
     629                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$9)
     630                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
     631                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     632                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x3c)
     633                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x1a)
     634                    $C$DW$T$10      .dwtag  DW_TAG_base_type
     635                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     636                            .dwattr $C$DW$T$10, DW_AT_name("int")
     637                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
     638                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("ptrdiff_t")
     639                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$10)
     640                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
     641                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     642                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x31)
     643                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x1c)
     644                    $C$DW$T$11      .dwtag  DW_TAG_base_type
     645                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     646                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     647                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
     648                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
     649                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$11)
     650                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
     651                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     652                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x35)
     653                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x19)
     654                    $C$DW$T$12      .dwtag  DW_TAG_base_type
     655                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     656                            .dwattr $C$DW$T$12, DW_AT_name("long")
     657                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
     658                    
     659                    $C$DW$T$64      .dwtag  DW_TAG_subroutine_type
     660                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$12)
     661                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
     662                    $C$DW$46        .dwtag  DW_TAG_formal_parameter
     663                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$3)
     664                            .dwendtag $C$DW$T$64
     665                    
     666                    $C$DW$T$65      .dwtag  DW_TAG_pointer_type
     667                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
     668                            .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
     669                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("pdTASK_HOOK_CODE")
     670                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
     671                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
     672                            .dwattr $C$DW$T$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     673                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x66)
     674                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x19)
     675                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
     676                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$12)
     677                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
     678                            .dwattr $C$DW$T$67, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     679                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x6d)
     680                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x0e)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   16

     681                    $C$DW$T$13      .dwtag  DW_TAG_base_type
     682                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     683                            .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
     684                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
     685                    $C$DW$T$22      .dwtag  DW_TAG_volatile_type
     686                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$13)
     687                    $C$DW$T$41      .dwtag  DW_TAG_pointer_type
     688                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$13)
     689                            .dwattr $C$DW$T$41, DW_AT_address_class(0x20)
     690                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("portTickType")
     691                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
     692                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     693                            .dwattr $C$DW$T$29, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     694                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x6a)
     695                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x1c)
     696                    $C$DW$T$14      .dwtag  DW_TAG_base_type
     697                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
     698                            .dwattr $C$DW$T$14, DW_AT_name("long long")
     699                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
     700                    $C$DW$T$15      .dwtag  DW_TAG_base_type
     701                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
     702                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
     703                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
     704                    $C$DW$T$16      .dwtag  DW_TAG_base_type
     705                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
     706                            .dwattr $C$DW$T$16, DW_AT_name("float")
     707                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
     708                    $C$DW$T$17      .dwtag  DW_TAG_base_type
     709                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
     710                            .dwattr $C$DW$T$17, DW_AT_name("double")
     711                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
     712                    $C$DW$T$18      .dwtag  DW_TAG_base_type
     713                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
     714                            .dwattr $C$DW$T$18, DW_AT_name("long double")
     715                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
     716                    $C$DW$T$53      .dwtag  DW_TAG_const_type
     717                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$6)
     718                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
     719                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
     720                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
     721                    
     722                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
     723                            .dwattr $C$DW$T$21, DW_AT_name("__va_list")
     724                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     725                    $C$DW$47        .dwtag  DW_TAG_member
     726                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$3)
     727                            .dwattr $C$DW$47, DW_AT_name("__ap")
     728                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("__ap")
     729                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     731                            .dwattr $C$DW$47, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include/s
     732                            .dwattr $C$DW$47, DW_AT_decl_line(0x32)
     733                            .dwattr $C$DW$47, DW_AT_decl_column(0x0c)
     734                            .dwendtag $C$DW$T$21
     735                    
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   17

     736                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     737                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x31)
     738                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
     739                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
     740                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
     741                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
     742                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/arm_5.1.7/include
     743                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x33)
     744                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
     745                    
     746                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     747                            .dwattr $C$DW$T$28, DW_AT_name("xLIST")
     748                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x14)
     749                    $C$DW$48        .dwtag  DW_TAG_member
     750                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     751                            .dwattr $C$DW$48, DW_AT_name("uxNumberOfItems")
     752                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("uxNumberOfItems")
     753                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     755                            .dwattr $C$DW$48, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     756                            .dwattr $C$DW$48, DW_AT_decl_line(0x88)
     757                            .dwattr $C$DW$48, DW_AT_decl_column(0x22)
     758                    $C$DW$49        .dwtag  DW_TAG_member
     759                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$25)
     760                            .dwattr $C$DW$49, DW_AT_name("pxIndex")
     761                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("pxIndex")
     762                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     763                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     764                            .dwattr $C$DW$49, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     765                            .dwattr $C$DW$49, DW_AT_decl_line(0x89)
     766                            .dwattr $C$DW$49, DW_AT_decl_column(0x17)
     767                    $C$DW$50        .dwtag  DW_TAG_member
     768                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$27)
     769                            .dwattr $C$DW$50, DW_AT_name("xListEnd")
     770                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("xListEnd")
     771                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     772                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     773                            .dwattr $C$DW$50, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     774                            .dwattr $C$DW$50, DW_AT_decl_line(0x8a)
     775                            .dwattr $C$DW$50, DW_AT_decl_column(0x19)
     776                            .dwendtag $C$DW$T$28
     777                    
     778                            .dwattr $C$DW$T$28, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     779                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x86)
     780                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     781                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("xList")
     782                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$28)
     783                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
     784                            .dwattr $C$DW$T$79, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     785                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x8b)
     786                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
     787                    
     788                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
     789                            .dwattr $C$DW$T$32, DW_AT_name("xLIST_ITEM")
     790                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x14)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   18

     791                    $C$DW$51        .dwtag  DW_TAG_member
     792                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$29)
     793                            .dwattr $C$DW$51, DW_AT_name("xItemValue")
     794                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("xItemValue")
     795                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     797                            .dwattr $C$DW$51, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     798                            .dwattr $C$DW$51, DW_AT_decl_line(0x73)
     799                            .dwattr $C$DW$51, DW_AT_decl_column(0x0f)
     800                    $C$DW$52        .dwtag  DW_TAG_member
     801                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$31)
     802                            .dwattr $C$DW$52, DW_AT_name("pxNext")
     803                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("pxNext")
     804                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     805                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$52, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     807                            .dwattr $C$DW$52, DW_AT_decl_line(0x74)
     808                            .dwattr $C$DW$52, DW_AT_decl_column(0x1f)
     809                    $C$DW$53        .dwtag  DW_TAG_member
     810                            .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$31)
     811                            .dwattr $C$DW$53, DW_AT_name("pxPrevious")
     812                            .dwattr $C$DW$53, DW_AT_TI_symbol_name("pxPrevious")
     813                            .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     814                            .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     815                            .dwattr $C$DW$53, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     816                            .dwattr $C$DW$53, DW_AT_decl_line(0x75)
     817                            .dwattr $C$DW$53, DW_AT_decl_column(0x1f)
     818                    $C$DW$54        .dwtag  DW_TAG_member
     819                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$3)
     820                            .dwattr $C$DW$54, DW_AT_name("pvOwner")
     821                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("pvOwner")
     822                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     823                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     824                            .dwattr $C$DW$54, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     825                            .dwattr $C$DW$54, DW_AT_decl_line(0x76)
     826                            .dwattr $C$DW$54, DW_AT_decl_column(0x09)
     827                    $C$DW$55        .dwtag  DW_TAG_member
     828                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$3)
     829                            .dwattr $C$DW$55, DW_AT_name("pvContainer")
     830                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("pvContainer")
     831                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     832                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     833                            .dwattr $C$DW$55, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     834                            .dwattr $C$DW$55, DW_AT_decl_line(0x77)
     835                            .dwattr $C$DW$55, DW_AT_decl_column(0x09)
     836                            .dwendtag $C$DW$T$32
     837                    
     838                            .dwattr $C$DW$T$32, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     839                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x71)
     840                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x08)
     841                    $C$DW$T$30      .dwtag  DW_TAG_volatile_type
     842                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$32)
     843                    $C$DW$T$31      .dwtag  DW_TAG_pointer_type
     844                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
     845                            .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   19

     846                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("xListItem")
     847                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$32)
     848                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
     849                            .dwattr $C$DW$T$23, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     850                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x79)
     851                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1b)
     852                    $C$DW$T$24      .dwtag  DW_TAG_volatile_type
     853                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
     854                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
     855                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
     856                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
     857                    
     858                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
     859                            .dwattr $C$DW$T$33, DW_AT_name("xMEMORY_REGION")
     860                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x0c)
     861                    $C$DW$56        .dwtag  DW_TAG_member
     862                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$3)
     863                            .dwattr $C$DW$56, DW_AT_name("pvBaseAddress")
     864                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("pvBaseAddress")
     865                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     867                            .dwattr $C$DW$56, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     868                            .dwattr $C$DW$56, DW_AT_decl_line(0x7a)
     869                            .dwattr $C$DW$56, DW_AT_decl_column(0x08)
     870                    $C$DW$57        .dwtag  DW_TAG_member
     871                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$13)
     872                            .dwattr $C$DW$57, DW_AT_name("ulLengthInBytes")
     873                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("ulLengthInBytes")
     874                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     875                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     876                            .dwattr $C$DW$57, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     877                            .dwattr $C$DW$57, DW_AT_decl_line(0x7b)
     878                            .dwattr $C$DW$57, DW_AT_decl_column(0x10)
     879                    $C$DW$58        .dwtag  DW_TAG_member
     880                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$13)
     881                            .dwattr $C$DW$58, DW_AT_name("ulParameters")
     882                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("ulParameters")
     883                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     884                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     885                            .dwattr $C$DW$58, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     886                            .dwattr $C$DW$58, DW_AT_decl_line(0x7c)
     887                            .dwattr $C$DW$58, DW_AT_decl_column(0x10)
     888                            .dwendtag $C$DW$T$33
     889                    
     890                            .dwattr $C$DW$T$33, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     891                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x78)
     892                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
     893                    $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("xMemoryRegion")
     894                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$33)
     895                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
     896                            .dwattr $C$DW$T$42, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
     897                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x7d)
     898                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
     899                    
     900                    $C$DW$T$43      .dwtag  DW_TAG_array_type
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   20

     901                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
     902                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
     903                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x0c)
     904                    $C$DW$59        .dwtag  DW_TAG_subrange_type
     905                            .dwattr $C$DW$59, DW_AT_upper_bound(0x00)
     906                            .dwendtag $C$DW$T$43
     907                    
     908                    
     909                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
     910                            .dwattr $C$DW$T$34, DW_AT_name("xMINI_LIST_ITEM")
     911                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x0c)
     912                    $C$DW$60        .dwtag  DW_TAG_member
     913                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$29)
     914                            .dwattr $C$DW$60, DW_AT_name("xItemValue")
     915                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("xItemValue")
     916                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     917                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     918                            .dwattr $C$DW$60, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     919                            .dwattr $C$DW$60, DW_AT_decl_line(0x7d)
     920                            .dwattr $C$DW$60, DW_AT_decl_column(0x0f)
     921                    $C$DW$61        .dwtag  DW_TAG_member
     922                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$31)
     923                            .dwattr $C$DW$61, DW_AT_name("pxNext")
     924                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("pxNext")
     925                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     926                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     927                            .dwattr $C$DW$61, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     928                            .dwattr $C$DW$61, DW_AT_decl_line(0x7e)
     929                            .dwattr $C$DW$61, DW_AT_decl_column(0x1e)
     930                    $C$DW$62        .dwtag  DW_TAG_member
     931                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$31)
     932                            .dwattr $C$DW$62, DW_AT_name("pxPrevious")
     933                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("pxPrevious")
     934                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     935                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     936                            .dwattr $C$DW$62, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\includ
     937                            .dwattr $C$DW$62, DW_AT_decl_line(0x7f)
     938                            .dwattr $C$DW$62, DW_AT_decl_column(0x1e)
     939                            .dwendtag $C$DW$T$34
     940                    
     941                            .dwattr $C$DW$T$34, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     942                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x7b)
     943                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
     944                    $C$DW$T$26      .dwtag  DW_TAG_typedef, DW_AT_name("xMiniListItem")
     945                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$34)
     946                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
     947                            .dwattr $C$DW$T$26, DW_AT_decl_file("H:\EECS_388\TI_ARM_Projects\FreeRTOS_Assembly\Source\incl
     948                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x81)
     949                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x20)
     950                    $C$DW$T$27      .dwtag  DW_TAG_volatile_type
     951                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
     952                    
     953                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
     954                            .dwattr $C$DW$T$44, DW_AT_name("xTASK_PARAMTERS")
     955                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x24)
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   21

     956                    $C$DW$63        .dwtag  DW_TAG_member
     957                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$37)
     958                            .dwattr $C$DW$63, DW_AT_name("pvTaskCode")
     959                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("pvTaskCode")
     960                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     962                            .dwattr $C$DW$63, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     963                            .dwattr $C$DW$63, DW_AT_decl_line(0x84)
     964                            .dwattr $C$DW$63, DW_AT_decl_column(0x0e)
     965                    $C$DW$64        .dwtag  DW_TAG_member
     966                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$40)
     967                            .dwattr $C$DW$64, DW_AT_name("pcName")
     968                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("pcName")
     969                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     970                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     971                            .dwattr $C$DW$64, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     972                            .dwattr $C$DW$64, DW_AT_decl_line(0x85)
     973                            .dwattr $C$DW$64, DW_AT_decl_column(0x1c)
     974                    $C$DW$65        .dwtag  DW_TAG_member
     975                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$9)
     976                            .dwattr $C$DW$65, DW_AT_name("usStackDepth")
     977                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("usStackDepth")
     978                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     979                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     980                            .dwattr $C$DW$65, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     981                            .dwattr $C$DW$65, DW_AT_decl_line(0x86)
     982                            .dwattr $C$DW$65, DW_AT_decl_column(0x11)
     983                    $C$DW$66        .dwtag  DW_TAG_member
     984                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$3)
     985                            .dwattr $C$DW$66, DW_AT_name("pvParameters")
     986                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("pvParameters")
     987                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     988                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     989                            .dwattr $C$DW$66, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     990                            .dwattr $C$DW$66, DW_AT_decl_line(0x87)
     991                            .dwattr $C$DW$66, DW_AT_decl_column(0x08)
     992                    $C$DW$67        .dwtag  DW_TAG_member
     993                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$13)
     994                            .dwattr $C$DW$67, DW_AT_name("uxPriority")
     995                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("uxPriority")
     996                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     997                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     998                            .dwattr $C$DW$67, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
     999                            .dwattr $C$DW$67, DW_AT_decl_line(0x88)
    1000                            .dwattr $C$DW$67, DW_AT_decl_column(0x19)
    1001                    $C$DW$68        .dwtag  DW_TAG_member
    1002                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$41)
    1003                            .dwattr $C$DW$68, DW_AT_name("puxStackBuffer")
    1004                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("puxStackBuffer")
    1005                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1006                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwattr $C$DW$68, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
    1008                            .dwattr $C$DW$68, DW_AT_decl_line(0x89)
    1009                            .dwattr $C$DW$68, DW_AT_decl_column(0x12)
    1010                    $C$DW$69        .dwtag  DW_TAG_member
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   22

    1011                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$43)
    1012                            .dwattr $C$DW$69, DW_AT_name("xRegions")
    1013                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("xRegions")
    1014                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1015                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1016                            .dwattr $C$DW$69, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
    1017                            .dwattr $C$DW$69, DW_AT_decl_line(0x8a)
    1018                            .dwattr $C$DW$69, DW_AT_decl_column(0x10)
    1019                            .dwendtag $C$DW$T$44
    1020                    
    1021                            .dwattr $C$DW$T$44, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
    1022                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x82)
    1023                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    1024                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("xTaskParameters")
    1025                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$44)
    1026                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1027                            .dwattr $C$DW$T$80, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
    1028                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x8b)
    1029                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    1030                    
    1031                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1032                            .dwattr $C$DW$T$45, DW_AT_name("xTIME_OUT")
    1033                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    1034                    $C$DW$70        .dwtag  DW_TAG_member
    1035                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$12)
    1036                            .dwattr $C$DW$70, DW_AT_name("xOverflowCount")
    1037                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("xOverflowCount")
    1038                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1040                            .dwattr $C$DW$70, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
    1041                            .dwattr $C$DW$70, DW_AT_decl_line(0x71)
    1042                            .dwattr $C$DW$70, DW_AT_decl_column(0x10)
    1043                    $C$DW$71        .dwtag  DW_TAG_member
    1044                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$29)
    1045                            .dwattr $C$DW$71, DW_AT_name("xTimeOnEntering")
    1046                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("xTimeOnEntering")
    1047                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1048                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1049                            .dwattr $C$DW$71, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/includ
    1050                            .dwattr $C$DW$71, DW_AT_decl_line(0x72)
    1051                            .dwattr $C$DW$71, DW_AT_decl_column(0x10)
    1052                            .dwendtag $C$DW$T$45
    1053                    
    1054                            .dwattr $C$DW$T$45, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
    1055                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x6f)
    1056                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    1057                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("xTimeOutType")
    1058                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$45)
    1059                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1060                            .dwattr $C$DW$T$81, DW_AT_decl_file("H:/EECS_388/TI_ARM_Projects/FreeRTOS_Assembly/Source/incl
    1061                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x73)
    1062                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x03)
    1063                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1064                    
    1065                    ;***************************************************************
TI ARM Assembler PC v5.1.7 Thu Dec 11 12:34:53 2014

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
Task_AsmCompute.asm                                                  PAGE   23

    1066                    ;* DWARF CIE ENTRIES                                           *
    1067                    ;***************************************************************
    1068                    
    1069                    $C$DW$CIE       .dwcie 14
    1070                            .dwcfi  cfa_register, 13
    1071                            .dwcfi  cfa_offset, 0
    1072                            .dwcfi  undefined, 0
    1073                            .dwcfi  undefined, 1
    1074                            .dwcfi  undefined, 2
    1075                            .dwcfi  undefined, 3
    1076                            .dwcfi  same_value, 4
    1077                            .dwcfi  same_value, 5
    1078                            .dwcfi  same_value, 6
    1079                            .dwcfi  same_value, 7
    1080                            .dwcfi  same_value, 8
    1081                            .dwcfi  same_value, 9
    1082                            .dwcfi  same_value, 10
    1083                            .dwcfi  same_value, 11
    1084                            .dwcfi  undefined, 12
    1085                            .dwcfi  undefined, 13
    1086                            .dwcfi  undefined, 14
    1087                            .dwcfi  undefined, 14
    1088                            .dwcfi  undefined, 7
    1089                            .dwendentry
    1090                            .dwendtag $C$DW$CU
    1091                    

--------------------------
Thumb2 Statistics
--------------------------
Number of Thumb2 ins converted to Thumb = 0 (0%)
Number of Thumb ins in input = 107 (89%)
Number of Thumb2 ins encoded as Thumb2 = 12 (100%)
Number of Thumb2 ins converted to 2 OPND Thumb = 27


No Assembly Errors, No Assembly Warnings
